Repository: georgesk/expeyes-web
Catalog: po/*.po
Languages: fr

source: 5-Dec-2011 : Met <a href="http://www.che.iitb.ac.in/online/node/52">Prof. Kannan Moudgalya</a> and gave a demo expEYES.
fr: 2011-12-05 : Rencontré <a href=\"http://www.che.iitb.ac.in/online/node/52\">Prof. Kannan Moudgalya</a> et fait une démonstration d'expEYES.

source: Period of oscillation of a pendulum can be measured by allowing it to intercept a beam of light falling on a photo-transistor. The LED is powered by SQR1 and the photo-transistor collector is connected to SEN, which goes to the internal analog comparator of the micro-controller. Oscillate the pendulum and measure the time period between alternate interceptions, count only for one direction.
fr: La période d'oscillation d'un pendule peut être mesurée en le laissant couper un faisceau de lumière qui arrive sur un photo-transistor. La DEL est alimentée par SQR1 et le collecteur du phototransistor est connecté à l'entrée SEN, qui est reliée au comparateur analogique du micro-contrôleur. Mettre le pendule en oscillation et mesurer la période entre interceptions successives ; compter dans une direction seulement.

source: The capture modifiers like Wait for Rising Edge can be enabled by dragging them to desired Input Sources. The selected actions are performed before every capture and display. Available modifier actions are listed below.
fr: Les modificateurs de capture comme <i>Wait for Rising Edge</i> peuvent être activés en les tirant sur les sources de données désirées. Les actions sélectionnées seront effectuées avant chaque capture et chaque affichage. Voir la liste des modificateurs ci-après.

source: Optical transmission of signals
fr: Transmission optique de signaux

source: Python for learning Science and Maths
fr: Python pour l'apprentissage des sciences de des mathématiques

source: AC mains pickup
fr: Influence du secteur alternatif

source: $sudo python mh-ide.py (To set non-root permissions, $sudo sh <a href="postinst">postinst</a> )
fr: $sudo python mh-ide.py (Pour régler les permisions pour les utilisateurs non-root, $sudo sh <a href="postinst">postinst</a> )

source: Shankar Systems<br/> Plot 21, Gali 6/2, Block C,<br/> Dechave Enclave,<br/> Najafgarh, NEW DELHI-110043.<br/> Ph:- 09810841403<br/> email : shankarsystemsdelhi1997 at gmail.com<br/>
fr: Shankar Systems<br/> Plot 21, Gali 6/2, Block C,<br/> Dechave Enclave,<br/> Najafgarh, NEW DELHI-110043.<br/> Tél. :- 09810841403<br/> Courriel : shankarsystemsdelhi1997 at gmail.com<br/>

source: The main program calls the subroutine in a loop, the data is incremented on each call. Use an oscilloscope to view the voltage waveform at each LED.
fr: Le programme principal appelle le sous-programme en boucle, les données sont incrémentées à chaque appel. Utiliser un oscilloscope pour visualiser lse signal de tension à chaque DEL.

source: Measuring the resistance of ordinary water by comparing it with a known resistance, is explained here. For ionic solutions measuring the DC resistance gives error, due to electrolysis and formation of gas bubbles at the electrodes. The AC voltage from SINE is connected to GND via a 10kOhm resistor. The black trace is the total voltage and the red one is the voltage across the 10k resistor.<br/> <br/> Total voltage Vt = 3.25 V<br/> <br/> Voltage across 10k = 2.6 V<br/> <br/> Current = 2.6 / 10000 = 0.26 mA<br/> <br/> Voltage across the electrodes = 0.65<br/> <br/> Resistance offered by the solution = 0.65 / .00026 = 2500 Ohms
fr: On explique ici comment mesurer la résistance de l'eau ordinaire en la comparant avec une résistance connue. Pour les solutions ionique, mesurer la résistance en courant continu donne une erreur, due à l'électrolyse et la formation de bulles de gaz sur les électrodes. La tension alternative de la borne SINE est connectée à GND à travers les électrodes et une résistance de 10k en série. La trace noire est la tension totale et la rouge est la tension aux bornes de la résistance de 10k.<br/> <br/> Tension totale Ut = 3,25 V<br/> <br/> Tension aux bornes des 10k = 2,6 V<br/> <br/> Courant = 2,6 / 10000 = 0,26 mA<br/> <br/> Tensions aux électrodes = 0,65 V<br/> <br/> Résistance de la solution = 0,65 / 0,00026 = 2500 Ohm

source: Data Indirect : In the previous mode, the address of the memory location is part of the instruction word. Here the address of the memory location is taken from the contents of the X, Y or Z registers. X, Y and Z are 16 bit registers made by combining two 8 bit registers (X is R26 and R27; Y is R28 and R29; Z is R30 and R31. This is required for addressing memory above 255.
fr: <i>Data Indirect</i>, accès indirect aux données : dans le mode précédent, l'adresse mémoire fait partie du mot d'instruction. Ici l'adresse mémoire est prise depuis le contenu des registres X, Y ou Z. Les registres X, Y et Z sont des registres 16 bit réalisés en combinant deux registres de 8 bit (X c'est R26 et R27 ; Y c'est R28 et R29 ; Z c'est R30 et R31). C'est nécessaire pour accéder à des adresses mémoire au-delà de 255.

source: The Android version is contributed by Jithin B P , IISER Mohali, (jithinbp at gmail.com).
fr: La version Android est une contribution de Jithin B P , IISER Mohali, (jithinbp at gmail.com).

source: Low Cost, <span class="medium-blue"> <a href="screenshots/ej-with-agilent.jpg">Accurate</a> measurements </span>
fr: Bon marché, <span class="medium-blue">mesures <a href="screenshots/ej-with-agilent.jpg">précises</a></span>

source: Oscillations of a Pendulum
fr: Oscillation d'un pendule

source: Download the <a href="http://www.iuac.res.in/%7Eelab/expeyes/Documents/mapy.pdf">Book in PDF forma</a>t and the <a href="http://www.iuac.res.in/%7Eelab/expeyes/Documents/learn-by-coding-1.2.0.deb"> code example browser</a>. A screen-shot of this program is <a href="images/learn-by-coding.png">here</a>. (<a href="Documents/mapy.pdf">Python book</a> and <a href="Documents/learn-by-coding-1.2.0.deb">Code Browser</a>)
fr: Télécharger le <a href="http://www.iuac.res.in/%7Eelab/expeyes/Documents/mapy.pdf">livre au format PDF</a> et le <a href="http://www.iuac.res.in/%7Eelab/expeyes/Documents/learn-by-coding-1.2.0.deb">navigateur d'exemple de codes</a>. <a href="images/learn-by-coding.png">Voici</a> une copie d'écran de ce programme. (<a href="Documents/mapy.pdf">livre Python</a> et <a href="Documents/learn-by-coding-1.2.0.deb">Navigateur de code</a>).

source: 18-Apr-2012: The Rpi board arrived. Help for testing came from Alex Bradbury.
fr: 2012-04-18 : Arrivée de la carte Raspberry Pi. L'aide pour les tests est venue d'Alex Bradbury.

source: Acceleration due to gravity can be calculated from the period measured. Since we have used a rod pendulum, the relation is g = 4 * pi * pi * L / (T*T) = 4*pi**2*15.4/.6432**2*2/3 = 979.7
fr: On peut calculer l'accélération de la gravité à partir de la mesure de prériode. Comme on a utilisé un pendule en barre, la relation est g = 4 * pi * pi * L / (T*T) = 4*pi**2*0,154/0,6432**2*2/3 = 9,797

source: Detecting voltage levels, Digital
fr: Détection de niveau de tension, numérique

source: Opto-Coupler
fr: Opto-Coupleur

source: <a href="http://schedule2012.rmll.info/Atelier-expEYES?lang=en">ExpEYES at RMLL2012</a>, presented by K K Abdulla &amp; P A Subha
fr: <a href="http://schedule2012.rmll.info/Atelier-expEYES?lang=en">ExpEYES aux RMLL2012</a>, presenté par K K Abdulla &amp; P A Subha

source: It is easier to use the script <a href="microhope/mhbootload32-usbasp.sh">mhbootload32-usbasp.sh</a> containing these commands.
fr: Il est plus facile d'utiliser le script <a href="microhope/mhbootload32-usbasp.sh">mhbootload32-usbasp.sh</a> qui contient ces commandes.

source: Transient Response of RC circuits
fr: Réponse transitoire de circuits RC

source: Gravity by Pendulum
fr: Détermination de la gravité avec un pendule

source: Full wave rectifier circuit using PN junctions. Two AC waveforms, 180 degree out of phase are required. The Sine wave generator and the same signal inverted are used.
fr: Redressement double alternance à l'aide de jonction PN. Il faut deux signaux alternatifs déphasés de 180°. On utilise le générateur de signal sinusoïdal et le même signal, inversé.

source: A Ramp Generator using R-2R DAC
fr: Un générateur de dent de scie à l'aide d'un convertisseur numérique-analogique R-2R

source: Cooling curve, water
fr: Courbe de refroisiddement, eau

source: ExpEYES Software
fr: Logiciel expEYES

source: <strong>The Status Register</strong>
fr: <strong>Le registre de statut</strong>

source: What we could do intuitively with an assignment operator (=) in C requires the use of more than one instruction.
fr: Ce qu'on pourrait faire intuitivement avec un opérateur d'assignation (=) en C requiert plus d'une instruction.

source: The downside of the Android version is that one cannot write simple Python scripts to develop new experiments, as done on the GNU/Linux version. An option to execute a sequence of function call is provided to remedy this.
fr: L'inconvénient de la version Android est qu'on ne peut pas écrire des scripts Python simples pour développer de nouvelles expériences, comme cela se fait dans la version GNU/Linux. Une option reste d'exécuter une séquence d'appels de fonction mises à disposition pour y remédier.

source: Ultra-sound, Generate &amp; measure
fr: Ultrasons, émission et mesure

source: The Carry, Zero and Half Carry bits will be set on port B.
fr: Les bits Carry, Zero et Half Carry seront positionnés sur le port B.

source: To upload blink.hex, issue the command
fr: Pour télécharger blink.hex, taper la commande

source: <strong><span style="color: rgb(128, 0, 0);">Writing the fuses and boot-loader to prepare ATmega32 to be used in MicroHOPE</span></strong>
fr: <strong><span style="color: rgb(128, 0, 0);">Écriture des fusibles et du chargeur de démarrage (bootloader) pour préparer l'ATmega32 à être utilisé avec microHOPE</span></strong>

source: Driven Pendulum, Resonance
fr: Pendule entretenu, résonance

source: Probability Density Function
fr: Fonction de probabilité de densité

source: MicroHOPE Hardware
fr: Matériel MicroHOPE

source: 50 documented experiments and easy to add more.
fr: 50 expériences documentées, et plus, faciles à créer.

source: Nov-2011: expEYS was released in Mar-2011 and is doing reasonably well. There was no plan to develop another version.
fr: 2011-11-xx : expEYES a été publié en mars 2011 et fonctionne raisonnablement bien. Il n'y a pas de plan pour développer une autre version.

source: Pendulum
fr: Pendule

source: We start with simple C programs, treating the uC as a device with programmable Input/Output pins, and then introduce the peripherals like ADC, communication ports etc. The uC architecture is explored using simple assembly language programs and LEDs connected to the I/O ports.
fr: On commence avec des programmes en C simples, qui traitent le micro-contrôleur comme un appareil avec des bornes d'entrée/sortie programmables, puis on introduit les périphériques comme les convertisseurs analogique-numériques, les ports de communication, etc. L'architecture du micro-contrôleur est explorée à l'aide de programmes simples en assembleur et de DELs connectés aux ports d'entrée/sortie.

source: 2bit Binary Counter
fr: Compteur binaire 2 bit

source: <b>Motor Control Board:</b><br/> The motor control board consists of 2 H-bridges (IC L293D). Board can be powered from outside or from the MicroHOPE socket. An INT/EXT jumper is provided to select the power option. The voltage level at the for outputs of L293 is decided by the four LSBs of the port on which it is connected. The outputs (A,B,C &amp; D) can be used for controlling 2 DC motors or one stepper motor.
fr: <b>Carte de contrôle de moteur :</b><br/> La carte de contrôle de moteur consiste en deux ponts en H (circuit L293D) La carte peut être alimentée de l'extérieur ou par le connecteur de microHOPE. Un cavalier INT/EXT est disponible pour choisir l'option d'alimentation. Le niveau de tension pour les sorties du L293 est décidé par les quatre bits de poids faible du port où il est connecté. Les sorties (A,B,C &amp; D) peuvent être utilisées pour contrôler deux moteurs à courant continu ou un moteur pas à pas.

source: Powerline Pickup
fr: Effet d'antenne

source: A 100 Hz squarewave is differentiated using the RC circuit shown below. In an ideal case the output should be a positive spike at every rising edge of the input and a negative spike every falling edge
fr: on différencie un signal carré de 100 Hz à l'aide du circuit RC montré ci-dessous. Dans un cas idéal, le signal de sortie devrait être un pic positif à chaque front montant du signal d'entrée et un pic négatif à chaque front descendant.

source: RL Circuit, phase shift
fr: Déphasage, circuits RL

source: Measuring DC voltage
fr: Mesure de tension continue

source: Vendor should inform IUAC about the sales so that we can keep track of the user community.
fr: Les vendeurs sont censés informer l'IUAC des ventes afin qu'on puisse garder trace de la communauté des utilisateurs.

source: Design of ExpEYES<br/> <br/> A simplified block diagram of ExpEYES is shown in the figure. The sensor/control elements are connected to the micro-controller. The user programs uses the Python Library to communicate to the micro-controller, running a program, written in C and Assembler. The micro-controller performs the control/measurement operations and sends the result back to the PC. The job is divided according to the capabilities and strong points of each device. The micro-controller does all the real time measurements and pass on the results to the PC where Python code is used for processing and displaying the data.
fr: Conception d'expEYES<br/> <br/> La figure présente un diagramme-bloc d'expEYES. Les éléments de contrôle et les capteurs sont connectés au micro-contrôleur. Les programmes utilisent la bibliothèque Python pour communiquer avec le micro-contrôleur, pour faire tourner le programme, écrit en C et en assembleur. Le micro-contrôleur effectue les opérations de contrôle/mesures et renvoie le résultat au PC. La division du travail est faite selon les points forts de chaque appareil. Le micro-contrôleur fait toute les mesures en temps réel et passe les résultats au PC où du code Python est utilisé pour traiter et afficher les données.

source: Temperature of cooling water is recorded as a function of time, using a PT100 temperature sensor. The experiment is repeated with coloured water, by adding some potassium permanganate. Resistance of PT100 sensor is a function of temperature. It is connected to a constant current source and the voltage drop is amplified and recorded.
fr: On enregistre la température de l'eau qui refroidit en fonction du temps, à l'aide d'une sonde de température PT100. On répète l'expérience avec de l'eau colorée, en ajoutant un peu de permangante de potassium. La résistance d'un capteur PT100 est une fonction de la température. On la connecte à une source de courant constant et la chute de tension est amplifiée et enregistrée.

source: 1-Jul-2012: Final PCB send for fabrication.
fr: 2011-12-29 : Circuit imprimé envoyé à la fabrication.

source: Resistor network, Ohm's Law
fr: Combinaison de résistances, loi d'Ohm

source: Transistor CE characteristic
fr: Caractéristique CE d'un transistor

source: <a href="http://s2s2.in/">S2S2 Services</a><br/> TV 33/268, Third Floor Elite Complex<br/> Netaji Road, Kannur 670 001<br/> Kerala<br/> Ph: 09447449107<br/> email : s2s2service at gmail.com <br/>
fr: <a href="http://s2s2.in/">S2S2 Services</a><br/> TV 33/268, Third Floor Elite Complex<br/> Netaji Road, Kannur 670 001<br/> Kerala<br/> Tél. : 09447449107<br/> Courriel : s2s2service at gmail.com <br/>

source: <a href="http://kishoreathrasseri.wordpress.com/2008/06/28/the-story-of-phoenix/">The story of PHOENIX</a>, by Kishore, 28-Jun2,2008
fr: <a href="http://kishoreathrasseri.wordpress.com/2008/06/28/the-story-of-phoenix/">L'histoire de PHOENIX</a>, par Kishore, 28 juin 2008

source: Running this program lights LEDs D2 and D3.
fr: Quand on lance ce programme, ça allume les DELs D2 et D3.

source: <strong><u>Audio Playback</u></strong>
fr: <strong><u>Restitution Audio</u></strong>

source: On the microHOPE board, the Rx/Tx pins of ATmega32 are connected to the USB to Serial Converter IC. User programs also can use this path to communicate to the PC via the USB port. The PCRST jumper should be removed when communication programs are running, to prevent the reset signal to ATmega32. The following examples are provided
fr: Sur la carte microHOPE, les bornes RX/TX de l'ATmega32 sont connectées au circuit convertisseur USB/série. Les programmes utilisateurs peuvent donc utiliser ce branchement pour communiquer vers le PC via le port USB. Le cavalier PCRST doit être retiré quand des programmes de communication sont en cours, pour éviter l'arrivée d'un signal RESET vers l'ATmega32. On fournit les exemples suivants

source: Sound Frequency
fr: Fréquence d'un son

source: The velocity of sound can be calculated by multiplying the frequency with this. The Piezo buzzer is driven by SQR1 and it is kept in front of the built-in microphone. The MIC output is connected to A1. The phase difference between the driving waveform and the MIC output is measured for different distances between the buzzer and the microphone.
fr: On peut calculer la vitesse du son en multipliant la fréquence par cette longueur. On pilote le buzzer piézo à l'aide de SQR1 et on le place en face du microphone intégré. La sortie MIC est connectée à l'entrée A1. Le déphasage entre la tension de pilotage et la sortie MIC est déterminée à différentes distances entre le buzzer et le microphone.

source: The software requirement is Python Interpreter along with <a href="http://www.scipy.org/getting-started.html">Numpy, Scipy</a> and <a href="http://matplotlib.org/">Matplotlib</a> packages.
fr: Les dépendances logicielles sont un interpréteur Python avec les paquets <a href=\"http://www.scipy.org/getting-started.html\">Numpy, Scipy</a> et <a href=\"http://matplotlib.org/\">Matplotlib</a>.

source: ExpEYES Junior can measure capacitance in the pico Farads range. The capacitance between IN1 and GND terminals are measured by using an internal constant current source.Measurements are done with and without connecting the capacitor, to subtract the stray capacitance. Figures below show measurement of a parallel plate capacitor and a 20pF dipped mica capacitor.
fr: ExpEYES Junior peut mesurer des capacités proches du picofarad. La capacité entre les bornes IN1 et GND est mesurée en utilisant une source de courant constant interne. Les mesures sont faite avant et après la connexion d'un condensateur, afin de soustraire la capacité interne. Les figures ci-dessous montrent la mesure de capacité d'un condensateur plan à plateaux parallèles et d'un condensateur de 20 pF au mica.

source: <a href="http://www.youtube.com/watch?v=7wNq-MWa0vc">FOSS.IN 2012, 29-Nov-2012 to 1-Dec-2012, Bengaluru</a>
fr: <a href="http://www.youtube.com/watch?v=7wNq-MWa0vc">FOSS.IN 2012, 29 novembre 2012 à 1er décembre 2012, Bengaluru</a>

source: Ultrasound ranging
fr: Mesure de distance à l'aide d'ultra-sons

source: IC555 monoshot circuit
fr: Monostable à circuit 555

source: Velocity of sound, by time of flight
fr: Vitesse du son, par temps de vol

source: Programs generally have variables, sometimes with initialized data. The expects them inside the .data segment. The following example shows how to access a data variable using direct and indirect modes.
fr: Les programmes ont en général des variables, quelquefois initialisées par des données. On s'attend à les trouver dans le segment .data. L'exemple suivant montre comment accéder aux données d'une variable en utilisant les modes direct et indirect.

source: C Program - <u>audio_streaming.c</u>
fr: Programme en C - <u>audio_streaming.c</u>

source: Diode I-V characteristic is plotted using the setup shown below. A 1N4148 silicon diode and a 1k resistor is connected in series from PVS to GND. The PVS output is varied from 0 to 5 volts and the voltage across the diode is measured in each case. The current is obtained from the voltage drop across the 1k resistor. The data is fitted with the diode equation to extract the ideality factor of the diode.
fr: On représente la caractéristique U-I d'une diode en utilisant le montage montré ci-dessous. Une diode 1N4148 au silicium et une résistance de 1k sont connectées en série entre la sortie PVS et la masse GND. On fait varier PVS de 0 à 5 V et la tension aux bornes de la diode est mesurée en permanence. La valeur du courant est obtenue à partir de la tension aux bornes de la résistance de 1k. Les données sont modélisées à l'aide de l'équation de la diode pour extraire le facteur d'idéalité de la diode.

source: Student :
fr: Étudiant :

source: Cooling curve, coloured solutions
fr: Courbe de refroidissement, solution colorée

source: <a href="microhope/remote-adc.c">remote-adc.c</a> and <a href="microhope/remote-adc.py">remote-adc.py</a>
fr: <a href="microhope/remote-adc.c">remote-adc.c</a> et <a href="microhope/remote-adc.py">remote-adc.py</a>

source: MicroHOPE software
fr: Logiciel MicroHOPE

source: A rotating motor is illuminated by a blinking LED powered by SQR1. The motor appears stationary when the rotations per second is same as the frequency of SQR1.
fr: On illumine un moteur en rotation à l'aide d'une DEL qui clignote grâce à SQR1. Le moteur apparaît stationnaire quand son nombre de tours par seconde est le même que la fréquence de SQR1.

source: Resistance of Human body
fr: Résistance électrique du corps humain

source: <b>USBASP Programmer board</b>:<br/> This is an open sourced ISP (In-System Programming) programmer available from <a href="http://www.fischl.de/usbasp/">http://www.fischl.de/usbasp/</a> . This is provided as an accessory to MicroHOPE due to several reasons. If you want to develop programs that uses the UART of Atmega32, you need to upload code using ISP. It can be used for programming other AVR micro-controllers also. It can be used for burning the boot loader. The LED on the board indicates power. It goes off while uploading code, giving an additional indication.
fr: <b>Carte de programmation USBASP :</b><br/> USBASP est un programme open-source de programmation ISP (In-System Programming) disponible à <a href="http://www.fischl.de/usbasp/">http://www.fischl.de/usbasp/</a>. Il est proposé comme accessoire de microHOPE pour plusieurs raisons. Si on veut développer des programmes utilisant l'UART de l'Atmega32, il faut télécharger le code à l'aide de l'ISP. On peut utiliser USBASP pour programmer d'autres micro-contrôleurs AVR aussi. On peut l'utiliser pour mettre en place le code du chargeur de démarrage (bootloader). La DEL sur la carte signale la présence de l'alimentation. Elle est éteinte durant le téléchargement de code, ce qui donne une indication supplémentaire.
