Repository: georgesk/expeyes-web
Catalog: po/*.po
Languages: fr

source: The transient response of an RL circuit is studied by applying a step voltage and observing the voltage across the inductor as a function of time. Connect the resistor from OD1 to A1 and the Inductor from A1 to GND. In response to the 5-&gt;0 volt step, the voltage across inductor suddenly goes to around -3 volts (the back EMF) and then discharges exponentially through the resistor. The R/L is extracted by fitting the graph and the value of inductor is obtained. We have used a 1k resistor and a 3000 turns coil of SWG44 wire.
fr: On étudie la réponse transitoire d'un circuit RL en appliquant un échelon de tension et en observant la tension au bornes de l'inductance en fonction du temps. Connecter la résistance entre OD1 et A1 et l'inductance entre A1 et la masse (GND). En réponse à l'échelon 5-&gt;0 V, la tension aux bornes de l'inductance devient soudainement proche de -3 V (la force contre-électromotrice) puis se décharge exponentiellement à travers la résistance. Le quotient R/L est calculé en modélisant la courbe et on obtient la valeur de L. On utilise une résistance de 1k et une bobine de 3000 tours de fil SWG44.

source: 13-Mar-12: Transmitted 1 million blocks, of 256bytes, from uC to PC without any error. ADC seems to be at par with the MCP3208 used in expEYES.
fr: 2012-03-13 : Transmis 1 million de de blocs de 256 octets, du microcontrôleur au PC, sans une seule erreur. La conversion analogique-numérique semble de qualité comparable avec celle faite dans expEYES avec le MCP3208.

source: WHI -- Wait for HIGH on the selected input
fr: WHI -- Wait for HIGH (attente d'un état HAUT) sur l'entrée sélectionnée

source: Op-amp Integrator
fr: Intégrateur à amplificateur opérationnel

source: Measuring speed of rotation
fr: Mesure de vitesse de rotation

source: <a href="http://www.downtoearth.org.in/content/lab-lap">Lab on the Lap</a>, Down to Earth Magazine, Jul 31, 2012
fr: <a href="http://www.downtoearth.org.in/content/lab-lap">Labo sur le portable</a>, Magazine <i>Down to Earth Magazine</i>, 31 juillet 2012

source: Diode IV Characteristic
fr: Caractéristique U-I d'une diode

source: Ultra-sound
fr: Ultra-sons

source: Interference of Sound
fr: Interférences sonores

source: 9-Dec-2011 : Prof. Kannan arranged meeting with N K Sinha, Director of NMEICT project, MHRD. Talked about the possibility of using expEYES with the Akash tablet PC. Shri Sinha wanted something costing only few hundred rupees. Also gave a demo at their committee meeting. Submitted a proposal to NMEICT for some human resource to conduct expEYES training programs and attended meeting on 26-Dec-11.
fr: 2011-12-09 : Prof. Kannan a arrangé une rencontre avec N K Sinha, directeur du projet NMEICT. Parlé de la possibilité d'utiliser expEYES avec la tablette Akash. Shri Sinha voulait quelque chose qui coûte seulement quelques centaines de roupies. Donné aussi une démonstration durant la réunion de leur comité. Soumis une proposition au NMEICT pour une ressource humaine afin de mener des programmes de formation à expEYES et assisté à la réunion du 26 décembre 2011.

source: Potentiometer, Angle encoder
fr: Potentiomètre, encodeur angulaire

source: Resistance of water
fr: Résistance de l'eau

source: Moving Data
fr: Déplacer des données

source: <b>Digital Input Board</b>:<br/> This board has 8 switches with series resistors, one end connected to ground. Can be used for feeding 8 bit input data to programs.
fr: <b>Carte d'entrées numériques</b> :<br/> Cette carte a 8 interrupteurs avec des résistances en série, une extrémité connectée à la masse. On peut l'utiliser pour entrer une donnée de 8 bit dans les programmes.

source: Jumps and Calls
fr: Sauts et appels de sous-programmes

source: A voltage controller oscillator is connected to PVS to generate a sinewave. The amplitude of the sinewave is measured by scanning the frequency.
fr: Un oscillateur commandé en tension est connecté à la sortie PVS pour générer un signal sinusoïdal. L'amplitude de ce signal est mesurée en scannant la fréquence.

source: The programs written so far has an execution flow from the beginning to the end, without any branching or subroutine calls, generally required in all practical programs. The execution flow can be controlled by CALL and JMP instructions.
fr: Les programmes écrits jusque là ont un flot d'exécution séquentiel, du début à la fin, sans branchement ni appel de sous-programmes, généralement requis dans tous les programmes usuels. Le flot d'exécution peut être contrôlé avec les instructions CALL et JMP.

source: Dielectric constant of organic liquids
fr: Constante diélectrique de liquides organiques

source: Plugin Modules
fr: Modules-greffons

source: Measuring Capacitance
fr: Mesure de capacité électrique

source: 31-Jan-12 : Attended the Technical Training Seminar by Microchip. Fortunately Microchip released development tools, MPLABX, for GNU/Linux also.
fr: 2012-01-31 : Assisté au Séminaire de Formation Technique par Microchip. Heureusement, Microchip a publié des outils de développement, MPLABX, pour GNU/Linux aussi.

source: The Programmable Voltage Source, PVS, can be set by entering a voltage between 0 and 5 volts.
fr: La source de tension programmable, PVS, peut être réglée en saisissant une tension entre 0 et 5 V.

source: <b>Digital Output Board</b>:<br/> This board has 8 LEDS with series resistors. It can be plugged into any of the four ports, the ground pin should be matched with that of the socket. Mainly used for displaying the results of assembly language programs and code debugging.
fr: <b>Carte de sorties numériques</b> :<br/> Cette carte a 8 DELs avec des résistances en série. On peut la brancher dans n'importe lequel des quatre ports, avec la borne de masse alignée sur celle du connecteur. On l'utilise principalement pour afficher les résultats de programmes en langage assembleur et déboguer le code.

source: WLO -- Wait for LOW on the selected input
fr: WLO -- attente d'un état BAS sur l'entrée sélectionnée

source: RLC Transient
fr: RLC, régime transitoire

source: Register Direct: MOV R1, R2 ; copies R2 to R1 . Two GPRs are involved in this. There are also operations that involves a single register like, INC R1
fr: Adressage direct de registres : MOV R1, R2 ; copie R2 dans R1. Deux GPRs sont impliqués. Il y a aussi des opérations qui impliquent un seul registre, comme INC R1

source: Blinking LED
fr: DEL clignotante

source: As per Ohm's law, current through a conductor is proportianl to the voltage across it. If both voltage and current are known, resistance can be calculated. An unknown resistance can be measured by comparing the voltage drop with that of a known resistor. Figure shows a 1k resistor from IN1 to Ground and an unknown resistor from PVS to IN1.
fr: Selon la loi d'Ohm, le courant qui traverse une résistance est proportionnel à la tension à ses bornes. Si on connaît à la fois la tension et le courant, on peut calculer la résistance. On peut mesurer une résistance inconnue en comparant la tension à ses bornes avec celle d'une résistance connue. Dans la figure on voit une résistance de 1k entre IN1 et GND et une résistance inconnue entre PVS et IN1.

source: The main GUI of expEYES Junior is an audio range 4-channel Digital Storage Oscilloscope, with several extra functions. An oscilloscope displays voltage as a function of time and it is a very useful tool for to study electrical and electronic circuits. An example screen is shown below. The EXPERIMENTS button provides a popup menu of programs required for various experiments.
fr: L'interface graphique principale d'expEYES Junior est un oscillographe à mémoire numérique à quatre canaux, pour les signaux audio, avec plusieurs fonctions additionnelles. Un oscilloscope affiche la tension en fonction du temps et c'est un outil très utile pour l'étude des circuits électriques et électroniques. Une copie d'écran typique est présentée ci-dessous. Le bouton EXPÉRIENCES fournit un menu déroulant de programmes relatifs à diverses expériences.

source: A square wave is applied to an RC circuit as shown in the figure below. The voltage across the capacitor is nearly triangular in shape. Integrating a square wave with time gives a triangular wave. The response depends on the Period of the applied wave and the RC time constant. In this case RC = 1.0e-6 x 1000 = 1 millisecond. The period of 1kHz wave is also the same.
fr: On applique un signal carré à un circuit RC comme montré dans la ficgure ci-dessous. La tension aux bornes du condensateur a une allure quasiment triangulaire. Quand on intègre un signal carré on obtient un signal traiangulaire. La réponse dépend de la période du signal appliqué et de la constante de temps RC. Dans ce cas, RC = 1.0e-6 x 1000 = 1 ms. La période du signal de 1 kHz est du même ordre de grandeur.

source: IC555 Oscillator
fr: Oscillateur 555

source: USB Powered.
fr: Alimenté par USB.

source: Light Dependent Resistor, LDR
fr: Photorésistance, LDR

source: Dielectric constant of ordinary windows glass is measured. A capacitor is made by pasting aluminium foils on both sides to make a capacitor. The dimensions are 13 cm x 10.6 cm x 0.4 cm and the measured capacitance is 225pF. The dielectric constant calculated is 7.38. This experiments can be repeated using other insulating materials.
fr: On mesure la constante diélectrique de vitres ordinaires. On réalise un condensateur en collant des feuilles d'aluminium des deux côtés. Les dimensions sont 13 cm x 10.6 cm x 0.4 cm et la capacité mesurée est 225 pF. La constante diélectrique calculée est donc 7,38. On peut refaire la même expérience avec divers matériaux isolants.

source: Audio Recording &amp; playback
fr: Enregistrement audio &amp; restitution

source: <a href="http://www.dnaindia.com/bangalore/report_turning-your-pc-into-a-science-lab_1749442">Turning your PC into a Science Lab</a>, Oct 6, Daily News and Analysis
fr: <a href="http://www.dnaindia.com/bangalore/report_turning-your-pc-into-a-science-lab_1749442">Transformez votre PC en labo de science</a>, 6 octobre, <i>Daily News and Analysis</i>

source: The Microhope Library
fr: La bibliothèque microHOPE

source: Software in Python programming language.
fr: Logiciel en langage de programmation Python.

source: Am &amp; FM
fr: Modulation d'amplitude, modulation de fréquence

source: expEYES Junior has a biult-in microphone, whose amplified output appears on terminal marked MIC. This can be used for capturing sound signals and measuring their frequency. For demonstration, use the Piezo buzzer connected to SQ1 to generate sound.
fr: ExpEYES Junior dispose d'un microphone intégré, dont la sortie amplifiée apparaît sur la borne marquée MIC. On peut l'utiliser pour capturer des signaux sonores et mesurer leur fréquence. Pour la démonstration, utiliser le buzzer piézo connecté à SQR1 pour créer un son.

source: There is a button to measure capacitance connected to IN1.
fr: Il y a un bouton pour mesurer la capacité connectée à IN1.

source: Simple AC generator
fr: Générateur alternatif simple

source: 12bit analog resolution.
fr: Résolution analogique 12 bit.

source: - An Open Source Portable Science Lab
fr: - Un laboratoire de sciences portable à source ouverte

source: IC555 oscillator
fr: Oscillateur 555

source: Temperature Sensors
fr: Capteurs de température

source: Hardware Availability
fr: Disponibilité du matériel

source: Flickering LED, persistance of vision
fr: DEL clignotante, persistance de la vision

source: The source files are <a href="https://github.com/jithinbp/ExpEYES_android">HERE</a>. You need to have an
fr: Les fichiers sources sont <a href="https://github.com/jithinbp/expEYES_android">ICI</a>. Il faut avoir un

source: <a href="Documents/Examples/projectile-2d-euler.py">projectile-2d-euler.py</a> : Projectile motion, trajectory in x-y plane calculated using Euler's method. <a href="Documents/Images/projectile-2d-euler.png">screenshot</a>
fr: <a href="Documents/Examples/projectile-2d-euler.py">projectile-2d-euler.py</a> : déplacement d'un projectile, trajectoire dans le plan x-y calculée à l'aide de la méthode d'Euler. <a href="Documents/Images/projectile-2d-euler.png">Copie d'écran</a>.

source: 6-Nov-2011 : <a href="http://www.aero.iitb.ac.in/%7Eprabhu/">Prabhu</a>,s mail ..Looking forward to seeing you at <a href="http://scipy.in/scipyin/2011/talks-cfp/speakers/">SciPy.in 2011</a>.
fr: 2011-11-06 : e-mail de <a href=\"http://www.aero.iitb.ac.in/%7Eprabhu/\">Prabhu</a> « ..Looking forward to seeing you at <a href=\"http://scipy.in/scipyin/2011/talks-cfp/speakers/\">SciPy.in 2011</a> ».

source: ExpEYES Brochure. Download from <a href="http://www.iuac.res.in/%7Eelab/expeyes/Documents/ej-brochure.pdf"> here </a> (or <a href="Documents/ej-brochure.pdf">here</a>)
fr: Brochure expEYES. À télécharger depuis <a href="http://www.iuac.res.in/%7Eelab/expEYES/Documents/ej-brochure.pdf"> ici</a> (ou <a href="Documents/ej-brochure.pdf">ici</a>)

source: The list of activities that can be done using expEYES Junior, first few are to get familiar with the equipment. Links are available for the ones already tested.
fr: La liste des activités qu'on peut faire à l'aide d'expEYES Junior ; les premières permettent de se familiariser avec le matériel. Des liens sont disponibles, pour celles qui sont déjà testées.

source: Most of the micro-controllers have the In-System Programming (ISP) feature, implemented using three pins, Serial ClocK (SCK), Master-In–Slave-Out (MISO) and Master-Out–Slave-In (MOSI). All types of memory on the micro-controller can be accessed using the SCK, MISO and MOSI pins, while holding the RESET pin LOW. These pins, along with ground, are available on the 5 pin header J7 on the microHOPE board.
fr: La plupart des micro-contrôleurs ont le système ISP (In-System Programming), implémenté à l'aide de trois bornes, <i>Serial ClocK</i> (SCK), <i>Master-In–Slave-Out</i> (MISO) et <i>Master-Out–Slave-In</i> (MOSI). On peut accéder à tous les types de mémoires sur le micro-contrôleur à l'aides des bornes SCK, MISO et MOSI, tant qu'on maintient la borne RESET à l'état BAS. Ces bornes, avec la masse, sont disponibles au niveau du connecteur à 5 broches J7 sur la carte microHOPE.

source: Loudspeaker as a Microphone
fr: Haut-parleur utilisé comme microphone

source: Already part of the software distribution. To install,
fr: Il fait déjà partie de la distribution logicielle. Pour l'installer,

source: or use the batch file <a href="microhope/mh-upload-usbasp.sh">mh-upload-usbasp.sh</a> like
fr: ou utiliser le script <a href="microhope/mh-upload-usbasp.sh">mh-upload-usbasp.sh</a> comme

source: The command
fr: La commande

source: <a href="http://linuxgazette.net/111/pramode.html">Experiments Physics with Phoenix and Python</a>, Feb-2005, by Pramode
fr: <a href="http://linuxgazette.net/111/pramode.html">Expériences de physique avec Phoenix et Python</a>, février 2005, par Pramode

source: 29-Jan-12 : Sent the PIC based PCB for fabrication. The memory bank switching found too slow for C code filling large arrays. The uC architecture doesn't look very C compiler friendly. Searched, with inputs from Pramode CE, for a 16 bit version satisfying the requirements, found PIC24FV32KA302. Supported by gcc.
fr: 2012-01-29 : Envoi du circuit imprimé à base de PIC à la fabrication. La commutation de banques de mémoire a été trouvée trop lente pour que le code C remplisse de grands tableaux. L'architecture du microcontrôleur ne semble pas très facile à appréhender avec un compilateur C. Recherché, avec l'aide de Pramode CE, pour une version 16 bit qui satisfasse les besoins, trouvé le PIC24FV32KA302. Supporté par gcc.

source: <a href="https://www.youtube.com/watch?v=z8iVJdpkwIY"> Spoken Tutorial on ExpEYES </a>
fr: <a href="https://www.youtube.com/watch?v=z8iVJdpkwIY"> Un tutoriel expEYES parlé</a>

source: <strong>General Purpose Registers</strong>
fr: <strong>Registres d'usage général (<i>General Purpose Registers, GPRs</i>)</strong>

source: A photo-transistor plus LED combination can be used for measuring light transmission and for sensing the timing of mechanical movements. The LED is powered by SQR1. The collector of the photo-transistor is connected to SEN, which is connected to 5 volts through a 5.1k resistor. The voltage at the collector of the photo transistor changes according to the amount of light falling on it. The built-in analog comparator on SEN input is used for timing measurements when the light crosses a certain threshold.
fr: Une combinaison DEL + photo-transistor peut être utilisée pour mesurer la transmission de lumière et pour capter les durées de mouvements mécaniques. On alimente la DEL à l'aide de SQR1. Le collecteur du photo-transistor est connecté à l'entrée SEN, qui est relevée à 5V par une résistance de 5,1k interne. La tension au collecteur du photo-transitor change selon la quantité de lumière qu'il reçoit. On utilise la comparateur intégré sur l'entrée SEN pour les mesures de durées, quand la lumière franchit un certain seuil.

source: <a href="microhope/pymicro.c">pymicro.c</a> and <a href="microhope/blink.py">blink.py</a>
fr: <a href="microhope/pymicro.c">pymicro.c</a> et <a href="microhope/blink.py">blink.py</a>

source: Digital Output OD1 and the Constant Current Source CCS can be controlled using the Checkbuttons.
fr: La sortie numérique OD1 et la sortie de courant constant CSS peuvent être contrôlées à l'aide des boutons à cocher.

source: RC Differentiation
fr: Différenciation RC

source: Resonance of Piezo disc
fr: Résonance d'un disque piézo

source: Hartley Oscillator
fr: Oscillateur d'Hartley

source: Demonstrate the conversion of electrical signals into light, transmission of the light signals, and converting them back to electrical signals. A square wave (black trace) is applied to the LED and the light is send to the photo-transistor. The output of the photo-transistor (red trace) is also shown. The frequency information of the original waveform is preserved but the photo-transistor OFF time is slower than ON time.
fr: On démontre la conversion de signaux électriques en lumière, la transmission des signaux lumineux, et leur conversion en signaux électriques. Un signal carré (trace noire) est appliqué à la DEL et la lumière est envoyée à un photo-transistor. La sortie du photo-transistor (trace rouge) est présentée aussi. L'information de fréquence du signal d'origine est préservée, mais le temps de descente du photo-transistor est plus lent que son temps de montée.

source: ATR -- Analog Trigger, the trace starts when the voltage is at the selected trigger level.
fr: ATR -- Trigger analogique, la trace débute quand la tension atteint la valeur seuil pour ce trigger.

source: Measurig Frequency
fr: Mesure de la fréquence

source: Transient response of RC circuits are studied. The voltage changes across the capacitor after applying a step voltage through a resistor is plotted. The RC time constant is calculated by fitting the discharge curve with the equation. The capacitor charging is exponential only when it is through a linear element like a resistor.
fr: On étudie la réponse transitoire de circuits RC. Les changements de tension aux bornes du condensateur après l'application d'un échelon de tension à travers une résistance sont représentés. La constante de temps RC est calculée en modélisant la courbe de décharge avec l'équation. La charge du condensateur est exponentielle seulement quand elles se produit à travers un élément linéaire tel qu'un conducteur ohmique.

source: Built-in Signal Generator and Oscilloscope
fr: Générateur de signaux et oscilloscope intégrés.

source: <a href="Documents/Examples/3phase-ac.py"> 3phase-ac.py</a> : Plots the 3 phases of 230 Vrms AC mains, and the voltage difference between two phases. <a href="Documents/Images/3phase-ac.png">screenshot</a>
fr: <a href="Documents/Examples/3phase-ac.py"> 3phase-ac.py</a> : traces les courbes de trois phases d'un courant du secteur à 230 V<sub>eff</sub>, et la différence de tension entre deux phases. <a href="Documents/Images/3phase-ac.png">Copie d'écran</a>.

source: I/O Direct : For moving data between the GPRs and the SFRs, since the SFRs can be accessed as I/O addresses. OUT 0x17, R1 copies R1 to DDRB. Please note that the I/O address is 20hex less than the memory mapped address (0x37) of the same SFR.
fr: Entrée/sortie directe : pour déplacer des données des GPRs vers les SFRs, comme on peut accéder aux SFRs par des adresses d'entrée/sortie. OUT 0x17, R1 copie R1 dans DDRB. Veuillez noter que l'adresse d'entré-sortie est 20hex de moins que l'adresse en mémoire générale (0x37) pour le même SFR.

source: <code>LDI R26, 0x60 ; address of location 0x0060 to X</code> <code>LDI R27, 0x00</code> <code>LD R16, X ; load R16 with the content of memory location pointed to by X</code>
fr: <code>LDI R26, 0x60 ; adresse de valeur 0x0060 vers X</code> <code>LDI R27, 0x00</code> <code>LD R16, X ; charger R16 avec le contenu de la mémoire pointée par l'index X</code>

source: Python program at the PC side to read the WAV file (with 8-bit samples and sampling rate of 48000) and send the samples:
fr: Programme Python du côté du PC pour lire le fichier WAV (échantillons sur 8-bit et vitesse d'échantillonnage 48000 Hz) et envoyer les échantillons :

source: AC and DC components of a voltage
fr: Composantes continue et alternative d'un signal

source: Connect an R-2R Digital to Analog Converter to port B, as shown below and run the program
fr: Connecter un convertisseur numérique-analogique R-2R au port B, comme montré ci-dessous et lancer le programme

source: Linear Charging of Capacitor
fr: Charle linéaire d'un condensateur

source: The lines .global __do_copy_data and .global __do_clear_bss tell the assembler to insert code for initializing the global variables, which is a must.
fr: Les lignes .global __do_copy_data et .global __do_clear_bss signifient à l'assembleur d'insérer du code pour initialiser les variables globales, ce qui est nécessaire.

source: Wide range, High school and above.
fr: Pour tous, jusqu'au lycée et au-delà.

source: Velocity of sound, by phase shift method
fr: Vitesse du son, par la méthode du déphasage

source: Period of a Pendulum, value of 'g'
fr: Période d'un pendule, valeur de « g »

source: We are already familiar with the Special Function Registers (including DDRB and PORTB) that were used to configure and control various features of the microcontroller. In addition to these ATmega32 has 32 general purpose registers (32 here is a coincidence. The 32 in ATmega32 refers to 32 kB of flash memory available for programming. All AVR micro-controllers, even ATmega8 or ATmega16 have 32 GPRs).
fr: On est déjà familier avec les registres de fonctions spéciales (incluant DDRB et PORTB) qui ont été utilisés pour configurer et contrôler diverses propriétés du micro-contrôleur. En plus de ceux-ci l'ATmega32 possède 32 registres d'usage général, les <i>GPRs</i> (le 32 ici est une coïncidence. Le 32 dans ATmega32 se réfère plutôt aux 32 koctets de la mémoire flash disponible pour programmer. Tous les micro-contrôleurs AVR, même l'ATmega8 ou l'ATmega16 possèdent les 32 GPRs).
