Repository: georgesk/expeyes-web
Catalog: po/*.po
Languages: fr

source: <a href="Documents/Examples/rdecay-scipy.py"> rdecay-scipy.py</a> : Radioactive decay curve. dN/dt = -L * N, solved using scipy.integrate.odeint() . <a href="Documents/Images/rdecay-scipy.png">screenshot</a>
fr: <a href="Documents/Examples/rdecay-scipy.py">rdecay-scipy.py</a> : courbe de décroissance radioactive.. dN/dt = -L * N, résolu à l'aide de scipy.integrate.odeint() . <a href="Documents/Images/rdecay-scipy.png">Copie d'écran</a>.

source: Generating DC voltage
fr: Générer une tension continue

source: People from IUAC
fr: Personnel de l'IUAC

source: <a href="Documents/Examples/plot-data-3d.py">plot-data-2d.py</a> : Reads multi-column text data from files and plots the first 2 columns, <a href="Documents/Images/plot-data-2d.png">screenshot</a> shows the data from file.
fr: <a href="Documents/Examples/plot-data-3d.py">plot-data-2d.py</a> : Lecture de données texte en plusieurs colonnes provenant de fichiers et tracé de courbe pour les deux premières colonnes, <a href="Documents/Images/plot-data-2d.png">voir la copie d'écran</a> : montre les données d'un fichier.

source: A voltage waveform need not be pure AC or DC. Any average voltage means a DC component and any variation in voltage means an AC component. We will demonstrate this by separating the AC and DC components of a squarewave swinging from 0 to 5 volts, by passing it though a capacitor. The experimental setup and the results are shown in the figures below. The DC component is stopped by the capacitor.
fr: Un signal d'entrée peut ne pas être purement continu ou alternatif. Toute tension moyenne signifie une composant continue et tout variation de tension siginife une composante alterntive. On va le démontrer en séparant les composantes continue et alternative d'un signal carré oscillant entre 0 et 5 V, en le passant à travers un condensateur. Le montage expérimental et les résultats sont montrés dans les figures ci-dessous. La composante continue est stoppée par le condensateur.

source: Actively involved in this project from the beginning, providing support in hardware fabrication and testing, trouble shooting and , if required, modifying the analog circuits involved. Did the analog circuits for the alpha spectrometer. Also involved in the activities of the teaching Lab maintenance.
fr: Activement impliqué dans ce projet depuis le début, fournissant de l'aide à la fabrication du matériel et pour les tests, les résolutions de problèmes, et si nécessaire, modifiant les circuits analogiques nécessaires. A réalisé les circuits analogiques pour le spectromètre alpha. Aussi impliqué dans les activités d'enseignement de la maintenance de laboratoire.

source: The code listed below (add.S) adds two numbers and displays the result on the LEDs connected to port B. <span style="color:#a52a2a;"> Instead of remembering the addresses of DDRB and PORTB, we have included the file 'avr/io.h' that contains all the Register names. Naming the program with <strong>.S</strong> (capital S instead of small s) invokes the pre-processor, </span> that also allows expressions like (1 &lt;&lt; PB3) to be used
fr: Le code listé ci-dessous (add.S) additionne deux nombres et affiche le résultat sur les DELs connectées au port B. <span style="color:#a52a2a;">Au lieu de mémoriser les adresses de DDRB et PORTB, on a inclus le fichier 'avr/io.h' qui contient tous les noms de registres. Quand le programme est nommé avec un <strong>.S</strong> (S majuscule plutôt que s minuscule), le pré-processeur est invoqué,</span> ce qui autorise aussi l'utilisation d'expressions telles que (1 &lt;&lt; PB3).

source: Frequency of Sound
fr: Fréquence du son

source: Uploading via ISP interface using USBASP
fr: Téléchargement via l'interface ISP à l'aide d'USBASP

source: Gravity, by time of flight
fr: Gravité, méthode du temps de vol

source: Measuring time intervals
fr: Mesures d'intervalles de temps

source: The block diagram of the MicroHOPE hardware is shown below. ATmega32 has 32 General Purpose Input/Output pins, organized as 8bit wide ports A,B,C and D on the 40 pin DIP package. Except for the 2 bits of Port D (connected to the USB to Serial converter) all the other 30 Input/Output pins are available to the user. The boot loader program is pre-loaded into the flash memory of ATmega32. To load a new program, the PC resets ATmega32 by sending a pulse through the RTS output of the USB to Serial Converter IC (MCP2200 in the new version). The boot loader code starts running after every reset, first checks for the arrival of new code via the USB link. If available, it is loaded into the flash and control is passed to it. If new code is not available, control is passed to the existing code. Even though ATmega32 is capable of running at 16 MHz, an 8MHz crystal is used to reduce the power consumption and heating.The Circuit Schematic is <a href="file:///home/ajith/expeyes-website/MicroHOPE/images/schematic.png">here</a>.
fr: Le diagramme-bloc du matériel microHOPE est montré ci-dessous. L'ATmega32 possède 32 bornes d'entrées/sorties à usage général, organisées en ports de 8 bit nommés A, B, C et D sur le brochage à 40 bornes DIP. À l'exception de 2 bits du port D (connectés au convertisseur USB/Série) toutes les 30 autres entrées/sorties sont accessibles à l'utilisateur. Le programme de chargement de démarrage (bootloader) est préchargé dans la mémoire flash de l'ATmega32. Pour charger un nouveau programme, le PC remet à zéro l'ATmega32 en envoyant une impulsion à travers la sortie RTS du convertisseur USB/Série (MCP2200 dans la nouvelle version). Le code de chargement de démarrage commence à fonctionner à chaque redémarrage, il commence à vérifier si un code nouveau se présente via le câble USB. S'il y en a, il est envoyé vers le flash et ensuite on lui passe le contrôle. Dans le cas contraire, le contrôle est passé au code déjà existant. Même si l'ATmega32 est capable de fonctionner à 16 MHz, un cristal de 8 MHz est utilisé pour réduire la consommation d'énergie et la surchauffe. Le schéma du circuit est <a href="file:///home/ajith/expeyes-website/MicroHOPE/images/schematic.png">ici</a>.

source: Persistence of vision, flickering LED
fr: Persistance de la vision, clignotement d'une DEL

source: Amplitude Modulation
fr: Modulation d'amplitude

source: The current from a battery flows in the same direction all the time and the amount of current does not change so long as the resistance of the circuite is constant. These are called Direct Current, or DC. A battery is a DC voltage source. The mains supply is AC or Alternating current. How does it vary with time. An easy way to compare the two is plotting the voltage as a function of time.<br/> <br/> The PVS output of expEYES is a DC source, and the SINE output is an AC source. Connect PVS to A1 and SINE to A2 and watch them using the CRO+ program. The peak voltage of our AC is 3.73 volts and the frequency is 151.5 Hz. For the mains supply voltages are in hundreds of volts and the frequency is either 50 or 60 Hz.<br/>
fr: Le courant d'une pile s'écoule dans le même sens tout le temps et la valeur du courant ne change pas tant que la résistance du circuit reste constante. On appelle ça le courant continu. Un pile fournit du courant continu. La tension du secteur fournit du courant alternatif. Celui-ci varie avec le temps. Un façon simple de les comparer est de tracer la courbe de la tension en fonction du temps. La sortie PVS d'expEYES est une source de tension continue, et la sortie SINE est une source alternative. Connecter PVS à A1 et SINE à A2 et observer le résultat à l'aide du programme CRO. La tension crête de notre source alternative est 3,73 V et sa fréquence est 151,5 Hz. Pour ce qui est de la tension du secteur, les tensions sont de l'ordre de centaines de volt et la fréquence est soit 50 soit 60 Hz.<br/>

source: The value of g is given by g= 2*h/t^2. The time is measured within one millisecond error. The experiment is repeated with different heights to eliminate the systematic error due to the finite time taken by the coil to release the ball.
fr: La valeur de g est donnée par g= 2*h/t^2. La mesure de temps a une précision d'une milliseconde. On répète l'expérience en variant la hauteur pour éliminer l'erreur systématique due au temps fini nécessaire pour que l'électro-aimant relâche la bille.

source: <a href="Documents/Examples/mass-spring-visual.py"> mass-spring-visual.py</a> : Mass Spring system animation using python-visual, computation using Euler method of integration
fr: <a href="Documents/Examples/mass-spring-visual.py"> mass-spring-visual.py</a> : système d'animation pour un ressort avec une masse utilisant python-visual, le calcul utilise la méthode d'intégration d'Euler.

source: Mutual induction, Transformer
fr: Induction mutuelle, transformateur

source: Two kinds of current, DC and AC
fr: Deux sotes de courant, continu et alternatif

source: <span style="font-weight: bold;"><a href="https://www.youtube.com/channel/UCzIRARfyO-cd1VezgZlEaQw" title="videos">Youtube Videos</a></span>
fr: <span style="font-weight: bold;"><a href="https://www.youtube.com/channel/UCzIRARfyO-cd1VezgZlEaQw" title="videos">Vidéos Youtube</a></span>

source: Bit 1 : Zero
fr: Bit 1 : Zéro

source: Python Programming of ExpEYES , <a href="https://www.youtube.com/watch?v=5P5Qu1qnYWY"> video </a>
fr: La programmation d'expEYES en Python, <a href="https://www.youtube.com/watch?v=5P5Qu1qnYWY"> en vidéo</a>

source: 12-Jan-12 : Went back to TC7660 since one of the TC1240A failed during continuous testing, keeping both versions.
fr: 2012-01-12 : Retour au TC7660 comme un des TC1240A a échoué durant les tests approfondis, gardé les deux versions.

source: For MSWindows, visit <a href="http://www.expeyes.herobo.com/microhope.php">http://www.expeyes.herobo.com/microhope.php</a>
fr: Pour MSWindows, visiter <a href="http://www.expeyes.herobo.com/microhope.php">http://www.expeyes.herobo.com/microhope.php</a>

source: Connect PD2 to ground momentarily and watch the LEDs.
fr: Connecter PD2 à la masse momentanément et observer les DELs.

source: 16-May-12 : expEYES was announced on <a href="http://www.raspberrypi.org/archives/1228">Raspberry Pi</a> webpage. Getting resonably good feedback and enquiries about availability. Planning to make USB &amp; Serial version (for Rpi), both having almost identical layout.
fr: 2012-05-16 : expEYES a été annoncé sur une page web de <a href=\"http://www.raspberrypi.org/archives/1228\">Raspberry Pi</a>. On a un feedback raisonnable et des réponses au sujet de l'approvisionnement. On fait des plans pour faire une version USB &amp; série (pour le RPi), avec un brochage pratiquement identique.

source: 7-Apr-12: Again some changes in hardware. Decided to provide only one amplifier. A digital output other that SQRs, all using a CMOS buffer IC. Introduced TC1240A after some continuous testing.
fr: 2012-04-07 : Encore quelques changements matériels. Décidé de ne fournir qu'un seul amplificateur. Une sortie numérique autre que les lsignaux carrés, tous utilisant un circuit intégré CMOS amplificateur. Introduit le TC1240A après des tests approfondis.

source: Hardwere
fr: Matériel

source: 7-Jun-2012: Started writing software and documentation. A CRO program with some extra features was done first. By end of June several boards were assembled. Some minor changes to the PCB. The read back of Square waves shifted to the after the buffer. Series resistors added to A1 and A2 inputs after level shifting. Got the plastic cabinets.
fr: 2012-06-07 : Commencé à écrire le logiciel et la documentation. Un programme de CRO avec quelques fonctionnalités supplémentaires a d'abord été créé. Vers la fin de juin plusieurs cartes ont été assemblées. Quelques changements mineurs au circuit imprimé. La boucle de lecture des signaux carrés a été déplacée après le tampon. Des résistances en série ont été ajoutées aux entrées de A1 et A2 après relèvement du niveau. Reçu les coques plastique.

source: <code>#include &lt;avr/io.h&gt;</code> <code> .section .text ; code section starts</code> <code>disp: ; our subroutine</code> <code> STS PORTB, R1 ; display R1 on port B</code> <code> INC R1 ; increments it</code> <code> RET ; and return</code> <code> .global main</code> <code>main:</code> <code> LDI, R16, 255</code> <code> STS DDRB, R16</code> <code> MOV R1, R16</code> <code>loop:</code> <code> RCALL disp ; relative call</code> <code> CALL disp ; direct call</code> <code> RJMP loop</code> <code> .end</code>
fr: <code>#include &lt;avr/io.h&gt;</code> <code> .section .text ; début de la section de code</code> <code>disp: ; notre sous-programme</code> <code> STS PORTB, R1 ; affiche R1 sur le port B</code> <code> INC R1 ; l'incrémente</code> <code> RET ; et revient</code> <code> .global main</code> <code>main:</code> <code> LDI, R16, 255</code> <code> STS DDRB, R16</code> <code> MOV R1, R16</code> <code>loop:</code> <code> RCALL disp ; appel relatif</code> <code> CALL disp ; appel direct</code> <code> RJMP loop</code> <code> .end</code>

source: The output of a condenser mic, amplified 100 times and level shifted to make the signal unipolar (circuits not shown here), is fed to the analog input pin PA0. The signal is sampled using the Atmega32's on-chip ADC, and streamed to the PC, where a python program stores the samples in the form of a wav file.
fr: La sortie d'un microphone à électret, amplifiée 100 fois et décalée pour rendre le signal unipolaire (circuits non montrés ici), est envoyée vers la borne d'entrée analogique PA0. Le signal est échantillonné à l'aide du convertisseur analogique-numérique intégré à l'Atmega32, et envoyé vers le PC, où un programme Python enregistre les échantillons sous forme d'un fichier WAV.

source: The motor is powered from the SQR2 but the duty cycle of the pulse on SQR2 should not exceed 50%, to avoid excess current drawn by the motor. Figure shows generation of a 2-phase AC by using two coils. The phase difference between the two AC outputs is decided by the angle between the axes of the two coils. In the normal 3-phase supply lines, it will be 120 degrees.
fr: On alimente le moteur à l'aide de SQR2 mais le rapport cyclique des impulsions sur SQR2 ne devrait pas dépasser 50%, pour éviter un excès de courant consommé par le moteur. La figure montre un courant alternatif biphasé généré grâce à deux bobines. La différence de phase entre les deux sorties de courant alternatif est commandée par l'angle entre les axes des deux bobines. Dans le cas des lignes triphasées, cet angle doit être de 120°.

source: <a href="Documents/Examples/projectile-2d-scipy.py">projectile-2d-scipy.py</a> : Projectile motion, trajectory in x-y plane calculated using scipy.integrate.odeint(). <a href="Documents/Images/projectile-2d-scipy.png">screenshot</a>
fr: <a href="Documents/Examples/projectile-2d-scipy.py">projectile-2d-scipy.py</a> : déplacement d'un projectile, trajectoire dans le plan x-y calculée à l'aide de scipy.integrate.odeint(). <a href="Documents/Images/projectile-2d-scipy.png">Copie d'écran</a>.

source: 1-May-2012: A serial port version of expEYES has been developed for Rpi. Communication tested between uC and Rpi. The PCB has been send for fabrication.
fr: 2012-05-01 : Un version port-série d'expEYES a été développée pour RPi. Communication testée entre le micro-contrôleur et le RPi. Le circuit imprimé a été envoyé à la fabrication.

source: Then run the program croplus.py
fr: Puis lancer le programme croplus.py

source: <a href="Documents/Examples/Lorentz-force-scipy.py">Lorentz-force-scipy.py</a> : Trajectory of a charged particle in electric and magnetic fields. <a href="Documents/Images/Lorentz-force-scipy.png">screenshot</a>
fr: <a href="Documents/Examples/Lorentz-force-scipy.py">Lorentz-force-scipy.py</a> : trajectoire d'une particule chargée dans des champs électrique et magnétique. <a href="Documents/Images/Lorentz-force-scipy.png">Copie d'écran</a>.

source: Optical Transmission of signals
fr: Transmission optique de signaux

source: Bit 2 : Negative
fr: Bit 2 : Négatif

source: Study LDR
fr: Étude d'une photorésistance

source: 16-Jul-2012: Units send to Pramode &amp; Georges, for testing.
fr: 2012-07-16 : Envoi d'échantillons à Pramode &amp; Georges, pour tester.

source: Transient Response of LCR Circuits
fr: Réponse transitoire de circuits RLC

source: <b>R-2R DAC Board:</b><br/> An 8 bit Digital to Analog Converter (DAC) is made using an R-2R network as shown in the schematic below. This can be used for generating arbitrary shaped voltage waveforms under software control.
fr: <b>Carte numérique-analogique R-2R :</b><br/> Un convertisseur numérique-analogique 8 bit (DAC) est réalisé en utilisant un réseau R-2R comme montré dans le schéma ci-dessous. On peut l'utiliser pour générer un signal de tension arbitraire sous contrôle logiciel.

source: Python Interpreter version 2.7xx
fr: Interpréteur Python version 2.7xx

source: Vibrant Systems and Softwares<br/> 1/4869H, 1st Floor Koyisco Building,<br/> Wyanad Road, East Nadakkavu,<br/> Calicut-673011.<br/> Ph: 9847193371.<br/> email: vibsys_n_soft at yahoo.com<br/>
fr: Vibrant Systems and Softwares<br/> 1/4869H, 1st Floor Koyisco Building,<br/> Wyanad Road, East Nadakkavu,<br/> Calicut-673011.<br/> Tél. : 9847193371.<br/> Courriel : vibsys_n_soft at yahoo.com<br/>

source: Software
fr: Logiciel

source: Cantilever, oscillations
fr: Oscillations, cantilever

source: Temperature Sensors
fr: Capteurs de température

source: An astable multivibrator is wired using IC555 and the frequency and duty cycle of the output are measured. Circuit and the output waveform are shown below. The 5 volt supply for IC555 is taken from OD1, by setting it HIGH. The frequency is given by f = 1/ (ln 2 × C × (R1 + 2R2 )). The HIGH time is given by ln 2×C ×(R1 + R2 ) and LOW time by ln 2 × C × R2 .
fr: Un multivibrateur astable est réalisé à l'aide d'un circuit 555, la fréquence et le rapport cyclique sont mesurées à la sortie. Le circuit et le signal de sortie sont montés ci-dessous. L'alimentation 5V pour le circuit 555 est fournie par OD1, en réglant la sortie à HAUT. La fréquence est donnée par f = 1/ (ln 2 × C × (R1 + 2R2 )). La durée correspondant au signal HAUT est donnée par ln 2×C ×(R1 + R2 ) et la durée du signal BAS par ln 2 × C × R2.

source: <a href="Documents/Examples/Lorentz-force-scipy-vector.py">Lorentz-force-scipy-vector.py</a> : Trajectory of a charged particle in electric and magnetic fields, using vector equations. <a href="Documents/Images/Lorentz-force-scipy-vector.png">screenshot</a>
fr: <a href="Documents/Examples/Lorentz-force-scipy-vector.py">Lorentz-force-scipy-vector.py</a> : trajectoire d'une particule chargée dans des champs électrique et magnétique, à l'aide d'équations vectorielles. <a href="Documents/Images/Lorentz-force-scipy-vector.png">Copie d'écran</a>.

source: The program listed below gives a slider to change the SQR1 frequency.
fr: Le programm listé ci-dessous donne un ascenseur graphique pour changer la fréquence de SQR1.

source: Transient Response of LCR circuits
fr: Réponse transitoire de circuits RLC

source: RL Transient
fr: RL, régime transitoire

source: MicroHOPE uses avrgcc to compile the C code and avrdude to upload it to the micro-controller, available on both GNU/Linux and MSWindows platforms. A minimal text editor, that can invoke the compile and upload programs is our IDE.
fr: MicroHOPE utilise avrgcc pour compiler le code C et avrdude pour le télécharger dans le micro-contrôleur ; ces deux commandes sont disponibles tant sous GNU/Linux que sous MSWindows. Un éditeur de texte minimal, qui peut invoquer les programmes de compilation et de téléchargement compose notre interface de développement.

source: Calculate the velocity of sound by measuring the pressure variation with distance. Sound travels as a series of compressions and rarefactions. Figure shows the High and Low pressure regions along the direction of travel, along with output of a pressure sensor at corresponding positions. We can display the pressure variation at any point with respect to the variation at the starting point. The phase of the microphone output waveform changes as you change its distance from the Piezo. Moving by one wavelength changes the phase by 360 degrees. If the phase changes by X degrees for D cm change in distance, the wavelength is given by λ = 360× D/X .
fr: On calcule la vitesse du son en mesurant la variation de pression avec la distance. Le son voyage comme une série de compressions et d'expansions. La figure montrer les régions de haute et basse pression le long de la direction de propagation, en même temps que la sortie du capteur de pression aux positions correspondantes. On peut affichier la variation de pression en tout point en fonction de la variation de pression au point de départ. La phase du signal de la sortie du microphone change quand on change sa distance au piézo. Quand on le déplace d'une longueur d'onde, la phase change de 360°. Si la phase change de X degrés pour une distance d cm, la longueur d'onde (en cm) sera donnée par 360&times;D/X .

source: 26-Mar-12: With assembler code ADC blockread giving 250 ksample/sec sampling rate, Timer1 ISR is used. Tested single channel block reads by capturing and fitting sine wave.
fr: 2012-03-26 : Avec le code assembleur, la lecture de blocs du convertisseur analogique-numérique donne une vitesse d'échantillonnage de 250 kéch/s, on utilise l'ISR Timer1. Testé les lectures de blocs sur un canal en capturant et modélisant un signal sinusoïdal.

source: Python TkInter module
fr: Module Python tkinter

source: <a href="Code/eyesj.py">Python Library</a>, on the PC side
fr: <a href="Code/eyesj.py">La bibliothèque Python</a>, du côté du PC

source: Python library functions can be executed, by typing them inside the command window.
fr: Des fonction de la bibliothèque Python peuvent être exécutées, en les tapant dans la fenêtre de commande.

source: Python Serial module
fr: Module Python serial

source: avrdude -B10 -c usbasp -patmega32 -U flash:w:<a href="ATmegaBOOT_168_atmega32.hex">ATmegaBOOT_168_atmega32.hex</a> # upload hex file<br/> avrdude -B10 -c usbasp -patmega32 -U lfuse:w:0xff:m -U hfuse:w:0xda:m # set fuses to 0xFF and 0xDA<br/> avrdude -b 19200 -P /dev/ttyACM0 -pm32 -c stk500v1 -n # verify the device on /dev/ttyACM0
fr: avrdude -B10 -c usbasp -patmega32 -U flash:w:<a href="ATmegaBOOT_168_atmega32.hex">ATmegaBOOT_168_atmega32.hex</a> # télécharger le fichier hex<br/> avrdude -B10 -c usbasp -patmega32 -U lfuse:w:0xff:m -U hfuse:w:0xda:m # régler les fusibles à 0xFF et 0xDA<br/> avrdude -b 19200 -P /dev/ttyACM0 -pm32 -c stk500v1 -n # vérifier l'appareil sur /dev/ttyACM0

source: <b>Exercise 1:</b> Load R16 and R17 with two numbers and study the results and status flags generated by the following operations.
fr: <b>Exercice 1 :</b> charger R16 et R17 avec deux nombres et étudier les résultats et les drapeaux de statut générés par les opérations suivantes.

source: Even though the 32 registers R0-31 are called "general purpose", there are special uses for some of them, which will be discussed later.
fr: Même si les 32 registres R0 à R31 sont réputés « à usage général », certains ont des utilisations spéciales, qu'on discutera plus loin.

source: One sample piece has to be certified by IUAC for quality of material and workmanship.
fr: Un échantillon doit être certifié par l'IUAC quant à la qualité du matériel et de la fabrication.

source: Library and Examples
fr: Bibliothèque et exemples

source: Measuring resistance by comparison
fr: Mesure de résistances par comparaison
