Repository: georgesk/expeyes-web
Catalog: po/*.po
Languages: fr

source: Resources to get started with ExpEYES:
fr: Ressources pour démarrer avec expEYES :

source: 3-Jan-12 : Sent another version of PCB for fabrication. To reduce size, it replaced TC7660 with TC1240A voltage doubler.
fr: 2012-01-03 : Envoi d'une autre version du circuit imprimé à la fabrication. Pour réduire la taille, il remplace le TC7660 par le doubleur de tension TC1240A.

source: Immediate : This mode can be used for transferring a number to any register from R16 to R31, like : LDI R17, 200. The data is provided as a part of the instruction.
fr: Immédiat : ce mode peut être utilisé pour transférer un nombre vers tous les registres de R16 à R31, comme : LDI R17, 200. Les données sont fournies au sein de l'instruction.

source: Resistance Temperature Detector (RTD) PT100 : Platinum element whose resistance is 100 Ohm at zero degree Celsius.
fr: Sonde PT100 : c'est un élément en platine dont la résistance est 100 Ohm à zéro degré Celsius.

source: Light-Barrier
fr: Barrière lumineuse

source: Clock divider
fr: Diviseur d'horloge

source: Voltage across the unknown resistor = 4.0 - 1.254 = 2.746 volts
fr: Tension aux bornes de la résistance inconnue = 4,0 - 1,254 = 2,746 V

source: ExpEYES is currently available from the following firms:
fr: ExpEYES est actuellement disponible chez les firmes suivantes :

source: Pushing a a swing in tune with its natural resonant frequency will make it go higher, ie. maximum amplitude. A pendulum is made using a permanent magnet suspended on a peice of paper and the pusing is done by a coil powered from SQR1. One end of a folded paper is held between two button magnets. The distance from the center of the magnet to the point of suspension is taken as its length.
fr: Si on excite un oscillateur à sa fréquence de résonance naturelle il ira plus haut, c'est à dire à son amplitude maximale. On réalise un pendule à l'aide d'un aimant suspendu à un bout de papier et l'excitation est réalisée à l'aide d'un bobinage alimenté par SQR1. Une extrémité d'une bande de papier repliée est pincée entre deux aimants-boutons. La distance du centre de l'aimant au point de suspension est prise comme longueur de ce pendule.

source: Bit 3 : Two's complement overflow
fr: Bit 3 : dépassement d'un complément à 2

source: Software is part of Debian &amp; Ubuntu
fr: Le logiciel est intégré à Débian et Ubuntu

source: AC plus DC, separte using capacitor
fr: Séparation de composantes continue et alternative à l'aide d'un condensateur

source: Fab.to.Lab (<a href="http://fabtolab.com/index.php?route=product/product&amp;product_id=80">Order Online</a>)<br/> Koramangala,<br/> Bangalore – 560095<br/> Ph: +91 8050032228/9<br/> email: sales at fabtolab.com<br/> <br/>
fr: Fab.to.Lab (<a href="http://fabtolab.com/index.php?route=product/product&amp;product_id=80">Commande en ligne</a>)<br/> Koramangala,<br/> Bangalore – 560095<br/> Tél. : +91 8050032228/9<br/> Courriel : sales at fabtolab.com<br/>

source: AC power line pickup
fr: Effet d'antenne dû aux tensions du secteur

source: Transient response of RC Circuit
fr: Réponse transitoire d'un circuit RC

source: 20-Apr-2012: expEYES tested on Rpi. Everything is fine except a USB error that allows only keyboard or mouse along with expEYES. Bug report filed.
fr: 2012-04-20 : test de expEYES sur Raspberry Pi. Tout va bien sauf une erreur USB qui autorise seulement le clavier ou la souris en même temps qu'expEYES. Envoi d'un rapport de bug.

source: PN Junction, Haf-wave rectifier
fr: Jonction PN, redressement simple alternance

source: <code>LDI R16, 10 ; load number</code> <code>MOV R17, R16 </code> <code>NEG R16 ; 2's complement</code> <code>ADD R17, R16</code>
fr: <code>LDI R16, 10 ; charger le nombre</code> <code>MOV R17, R16 </code> <code>NEG R16 ; complément à 2</code> <code>ADD R17, R16</code>

source: IC555 Monostable Multivibrator
fr: Multivibrateur Monostable à circuit 555

source: User's manual, in PDF format, may be downloaded from <a href="http://www.iuac.res.in/%7Eelab/expeyes/Documents/microhope.pdf">here</a> (or <a href="file:///home/ajith/expeyes-website/Documents/microhope.pdf">here</a>)
fr: Le manuel du programmeur. À télécharger depuis <a href="http://www.iuac.res.in/%7Eelab/expEYES/Documents/microhope.pdf"> ici</a> (ou <a href="Documents/microhope.pdf">ici</a>)

source: Cooling Curve
fr: Courbe de refroidissement

source: 2-Aug-2012: Finished <a href="software.html">Software</a> and a <a href="http://expeyes.in/Documents/eyesj-a4.pdf">User Manual</a> describing around 50 experiments are ready. Website update and videos are pending.
fr: 2012-08-02 : Terminé le <a href=\"software.html\">logiciel</a> et le <a href=\"http://expeyes.in/Documents/eyesj-a4.pdf\">manuel utilisateur</a> qui décrit quelques 50 expériences. Mise à jour du site web, les vidéos sont en cours de réalisation.

source: Python Imaging Library module
fr: Module Python Imaging Library

source: Dielectric constant of glass
fr: Constante diélectrique du verre

source: The current from a battery flows in the same direction all the time and the amount of current does not change so long as the resistance of the circuite is constant. These are called Direct Current, or DC. A battery is a DC voltage source. The mains supply is AC or Alternating current. How does it vary with time. An easy way to compare the two is plotting the voltage as a function of time. The PVS output of expEYES is a DC source, and the SINE output is an AC source. Connect PVS to A1 and SINE to A2 and watch them using the CRO+ program. The peak voltage of our AC is 3.73 volts and the frequency is 151.5 Hz. For the mains supply voltages are in hundreds of volts and the frequency is either 50 or 60 Hz. <br/>
fr: Le courant d'une pile s'écoule dans le même sens tout le temps et la valeur du courant ne change pas tant que la résistance du circuit reste constante. On appelle ça le courant continu. Un pile fournit du courant continu. La tension du secteur fournit du courant alternatif. Celui-ci varie avec le temps. Un façon simple de les comparer est de tracer la courbe de la tension en fonction du temps. La sortie PVS d'expEYES est une source de tension continue, et la sortie SINE est une source alternative. Connecter PVS à A1 et SINE à A2 et observer le résultat à l'aide du programme CRO. La tension crête de notre source alternative est 3,73 V et sa fréquence est 151,5 Hz. Pour ce qui est de la tension du secteur, les tensions sont de l'ordre de centaines de volt et la fréquence est soit 50 soit 60 Hz.<br/>

source: Driven Pendulum
fr: Pendule entretenu

source: A monostable multivibrator is wired and tested using IC555.
fr: On câble et on teste un multivibrateur astable à l'aide d'un circuit 555.

source: Introduced the idea of using <a href="http://linuxgazette.net/111/pramode.html">Python language for Phoenix</a> , something that had a tremendous impact on the project. Suggests new ideas and solutions and also works for spreading awareness about the project.
fr: A introduit l'idée d'utiliser <a href="http://linuxgazette.net/111/pramode.html">le langage Python pour Phoenix</a>, ce qui a eu un impact considérable sur le projet. Suggère de nouvelles idées et des solutions et travaille aussi à promouvoir la connaissance du projet.

source: Vibrating String, resonant frequency
fr: Corde vibrante, fréquence de résonance

source: 20-Aug-2012: First lot of commercial production started.
fr: 2012-08-20 : Démarrage du premier lot de production commerciale.

source: <code>.section .text ; denotes code section</code> <code> .global main</code> <code>main:</code> <code> ldi r16, 255 ; load r16 with 255</code> <code> out 0x17, r16 ; send R16 to DDRB using I/O address</code> <code> out 0x18, r16 ; and to PORTB also</code> <code> .end</code>
fr: <code>.section .text ; dénote la section de code</code> <code> .global main</code> <code>main:</code> <code> ldi r16, 255 ; charger r16 avec 255</code> <code> out 0x17, r16 ; envoyer r16 vers DDRB en utilisant l'adresse d'entrée/sortie</code> <code> out 0x18, r16 ; et aussi à PORTB</code> <code> .end</code>

source: Project Title :
fr: Titre du projet :

source: <a href="http://2010.rmll.info/Experimental-Physics-with-Phoenix-and-Python.html?lang=fr">PHOENIX presentation</a>, by Kishore, accepted for RMLL2010
fr: <a href="http://2010.rmll.info/Experimental-Physics-with-Phoenix-and-Python.html?lang=fr">Présentation de PHOENIX</a>, par Kishore, accepté pour RMLL2010

source: Resistance of the LDR is measured by comparing it with a 10k resistor. PVS is set to 4 volts and the LDR and 10k resistor are connected from PVS to GND in series. The voltage across 10k is measured to find out the current. The voltage drop across the LDR is obtained by subtracting IN1 from PVS. Using these and the value of current, the resistance of LDR is calculated.
fr: La résistance d'une LDR est mesurée en la comparant à une résistance fixe de 10k. On règle PVS à 4 V, la LDR et la résistance de 10k sont connectées en série entre PVS et GND. La tension aux bornes de la résistance de 10k est mesurée pour déterminer le courant. La tension aux bornes de la LDR est calculée en soustrayant la valeur de IN1 de celle de PVS. En utilisant celle-ci et la valeur du courant, on calcule la résistance de la LDR.

source: Selected for Google Summer of Code 2014.
fr: Sélectionné pour le « Google Summer of Code » 2014

source: Conductivity of water
fr: Conductivité de l'eau

source: Organization:
fr: Organisation :

source: The Piezo electric undergoes compressions and expansions under the applied voltage. The resonant frequency depends on the support material and the dimensions. The 27 mm diameter disc used in this case has a resonant frequency of around 3800 Hz.
fr: Le matériau piézoélectrique subit des compressions et des expansions sous l'effet de la tension appliquée. La fréquence de résonance dépend du matériau de support et des dimensions. Le disque de 25 mm de diamètre utilisé dans ce cas a une fréquence de résonance proche de 3800 Kz.

source: Created and maintaining an <a href="http://expeyes.wordpress.com/">expEYES blog site</a>. Actively involved in conducting training programs. Working on a new Live CD.
fr: A créé et maintient un <a href="http://expeyes.wordpress.com/">blog sur expEYES</a>. Impliqué activement dans les programmes de formation. Travaille sur un nouveau CD vif.

source: Initiated the PHOENIX project by designing a parallel port based interface and organized a training program for teachers in 2005, and continuing with it. Does designing, developing experiments and writing software and documentaion for all the equipment from this project. Spend some amount of time in conducting training programs.
fr: A initié le projet PHOENIX en créant une interface basée sur le port parallèle et en organisant un programme de formation pour les enseignants en 2005, et en continuant ensuite. S'occupe de la conception, du développement des expériences et de l'écriture du logiciel et de la documentation pour tous les équipements de ce projet. Passe un peu de temps a mener des programmes de formation.

source: Enabling FIT on any channel calculates the Amplitude and Frequency by fitting the data.
fr: Si on active FIT sur chaque canal on calcule l'amplitude et la fréquence par modélisation des données.

source: To use the device as a normal user, <a href="Code/postinst.sh">download the file</a> to set the USB permissions by running.<br/> <br/> # sh postinst.sh<br/> <br/> 4. On MS Windows<br/> <br/> Since the programs are written in Python, the same source code works on GNU/Linux and Windows. You need to install Python Interpreter and the required libraries. The USB device appears as an RS232 connection to the software. The virtual COM port is established by the driver software for the USB to Serial converter MCP2200
fr: Pour utiliser l'appareil en tant qu'utilisateur normal, <a href="Code/postinst.sh">téléchargez le fichier</a> pour régler les permissions pour l'USB, en le lançant : <br/> <pre> # sh postinst.sh<br/> </pre> <br/> 4. Pour MS Windows<br/><br/> Comme les programmes sont écrits en Python, les mêmes codes sources fonctionnent sous GNU/Linux et Windows. Il faut installer l'interpréteur Python et les bibliothèques requises. Le port COM virtuel est établi par le logiciel pilote pour le convertisseur USB/série MCP2200

source: The rate of cooling for clear and coloured water is almost identical.
fr: Les vitesses de refroidissement de l'eau claire et de l'eau colorée sont quasiment identiques.

source: <a href="Documents/Examples/Lorentz-force-euler.py">Lorentz-force-euler.py</a> : Trajectory of a charged particle in electric and magnetic fields. <a href="Documents/Images/Lorentz-force-euler.png">screenshot</a> , circle is becoming spiral due to computational error.
fr: <a href="Documents/Examples/Lorentz-force-euler.py">Lorentz-force-euler.py</a> : trajectoire d'une particule chargée dans des champs électrique et magnétique. <a href="Documents/Images/Lorentz-force-euler.png">Voir la copie d'écran</a> ; le cercle devient une spirale à cause d'une erreur numérique.

source: Clock Divider, using D Flipflop
fr: Diviseur de fréquence, à l'aide d'une bascule D

source: Don't get exited with the accuracy of the result. It might have come closer to the actual value due to the error in measuring the length. What really maters is the small spread in the measured value. The frequency change due to large amplitudes can be easily observed.
fr: Il ne faut pas trop s'enthousiasmer de la précision du résultat. On pourrait arriver plus près de la vraie valeur grâce à une erreur dans la mesure de longueur. Ce qui compte vraiment c'est la faible dispersion des valeurs mesurées. Le changement de fréquence dû à des grandes amplitudes s'observe aisément.

source: <a href="Documents/Examples/plot-ncurve.py">plot-ncurve.py</a> : Plot some interesting graphs . <a href="Documents/Images/plot-ncurve.png">screenshot</a>
fr: <a href="Documents/Examples/plot-ncurve.py">plot-ncurve.py</a> : tracé de quelques courbes intéressantes. <a href="Documents/Images/plot-ncurve.png">Copie d'écran</a>.

source: To code in assembler, one should have some idea about the architecture of the target hardware. It is enough to assume that the AVR micro-controller appears to the programmer as a set of General Purpose Registers (GPRs: R1 to R31), Special Functions Registers (SFRs) that controls the peripherals, some data memory (2kbytes of SRAM for Atmega32). All of them are in the data address space. We also have Program memory and EEPROM in different address spaces.
fr: Pour coder en assembleur, il faut avoir une petite idée au sujet de l'architecture matérielle du matériel-cible. Il suffit de considérer que le micro-contrôleur AVR apparaît au programmeur comme un ensemble de registres à usage général (les GPRs: R1 à R31), de registres de fonctions spéciales (SFRs) qui contrôlent les périphériques, un peu de mémoire pour les données (2 koctets de SRAM pour l'Atmega32). Tous sont dans l'espace d'adressage des données. Il y a aussi une mémoire de programme et une EEPROM dans des espaces de mémoire distincts.

source: Bit 4 : Sign bit, exclusive OR of N and V
fr: Bit 4 : Bit de signe, OU exclusif de N et V

source: The force experienced by a current carrying conducter placed in a magnetic field is demonstrated by placing a permanent magnet inside a solenoid and applying an AC signal to it. The magnet moves back and forth up to a frequency of around 2000 Hz and a humming sound is produced. The working principle is same as that of a loudspeaker, where the magnet is fixed and the coil moves along with the paper cone.
fr: On fait la démonstrattion de la force ressentie par un conducteur porteur de courant placé dans une champ magnétique en plaçant un aimant permanent dans un solénoïde et en y appliqant un signal alternatif. L'aimant se déplace de part et d'autre à une fréquence proche de 2000 Hz et un bourdonnement est produit. Le principe de fonctionnement est le même que celui d'un haut-parleur, quand l'aimant est fixe et que le bobinage se déplace en entraînant un cône de papier.

source: Scipy and Numpy modules
fr: Modules Scipy et Numpy

source: Transistor-CE
fr: Caractéristique CE d'un transitor

source: Windows version of the program<br/> A native Windows program is also available. It includes the main osciloscope application and severel experiments. More details are at <a href="http://www.expeyes.herobo.com/">http://www.expeyes.herobo.com/</a><br/>
fr: Versions Windows du programme<br/> Un programme Windows natif est aussi disponible. Il inclut l'application oscilloscope principale et plusieurs expériences. Il y a plus de détails à <a href="http://www.expeyes.herobo.com/">http://www.expeyes.herobo.com/</a><br/>

source: Up to 4 analog channels, chosen from the seven input sources can be plotted at a time.
fr: Jusqu'à 4 canaux analogiques, choisis parmi sept sources d'entrées peuvent être représentés graphiquement ensemble.

source: Several videos made during writing these examples also have been uploaded to the Youtube. (Keeping the RecordmyDesktop program running and mumbling while writing code can generate the drag and audio comparable to that of a 19th century steam locomotive)
fr: Plusieurs vidéos faites durant l'écriture de ces exemples ont été aussi téléchargées sur Youtube (laisser le programme RecordmyDesktop fonctionner pendant qu'on écrit du code peu générer des images et une piste audio comparables à celles d'une locomotive à vapeur du 19ème siècle).

source: MicroHOPE Software
fr: Logiciel MicroHOPE

source: <a href="http://www.youtube.com/watch?feature=player_embedded&amp;v=F1h4q-Kw7W8">PHOENIX at ADOC2.0</a>, 5-6 Oct-2010, Taipei.
fr: <a href="http://www.youtube.com/watch?feature=player_embedded&amp;v=F1h4q-Kw7W8">PHOENIX à ADOC2.0</a>, 5-6 octobre 2010, Taipei.

source: <a href="Documents/Examples/rdecay-scipy-2.py">rdecay2-scipy.py</a> : Radioactive decay curve. dN/dt = L * N. Two of them solved at a time using scipy.integrate.odeint() . <a href="Documents/Images/rdecay-scipy-2.png">screenshot</a>
fr: <a href="Documents/Examples/rdecay-scipy-2.py">rdecay2-scipy.py</a> : courbe de décroissance radioactive. dN/dt = L * N. Solution de deux d'entre elles en même temps à l'aide de scipy.integrate.odeint() . <a href="Documents/Images/rdecay-scipy-2.png">Copie d'écran</a>.

source: Resonance, of a swing
fr: Résonance pour une masse pendue à un ressort

source: <a href="microhope/cro.c">cro.c</a> and <a href="microhope/cro.py">cro.py</a>
fr: <a href="microhope/cro.c">cro.c</a> et <a href="microhope/cro.py">cro.py</a>

source: Frequency Divider using D flipflop
fr: Diviseur de fréquence à l'aide d'une bascule D

source: <a href="http://www.svtechnocrafts.in/">S.V. Techno Crafts</a><br/> 86, J.D. Nagar, Patamata,<br/> VIJAYAWADA - 520010<br/> Ph: 09440978459<br/> email : pur.svtc@gmail.com<br/>
fr: <a href="http://www.svtechnocrafts.in/">S.V. Techno Crafts</a><br/> 86, J.D. Nagar, Patamata,<br/> VIJAYAWADA - 520010<br/> Tél. : 09440978459<br/> Courriel : pur.svtc@gmail.com<br/>

source: There are situations where the uC should respond to external events, stopping the current program temporarily. This is done using Interrupts, that are external signals, either from the I/O pins or from from some of the peripheral devices. On receiving an interrupt signal, the processor stores the current Program Counter to the memory location pointed to by the Stack Pointer and jumps to the corresponding interrupt vector location (For example, the processor will jump to location 0x0002 (0x0004 if you count them as bytes), if external interrupt pin INT0 is activated, provided the interrupt is enabled by the processor beforehand
fr: Il y a des situations où le micro-contrôleur répond à des évènements extérieurs, en arrêtant le programme en cours de façon temporaire. C'est fait à l'aides des Interruptions, qui sont des signaux externes, venant soit de bornes d'entrées/sorties ou de certains appareils périphériques. Quand un signal d'interruption est reçu, le processeur stocke le compteur de programme courant dans la position de la mémoire pointée par le pointeur de pile et il saute à l'adresse du vecteur d'interruption correspondant ; par exemple, le processeur sautera à l'adresse 0x0002 (0x0004 si on compte en octets) si l'interruption externe de la broche INT0 est activée, à condition que l'interruption soit autorisée par avance par le processeur

source: is used for uploading the code that makes an LED connected to PB0 blink.
fr: est utilisé pour télécharger le code qui fait clignoter la DEL connectée à PB0.

source: RC Transient
fr: RC, régime transitoire

source: XMG transfers data in an Xmgrace window.
fr: XMG transfère les données dans une fenêtre Xmgrace.

source: 17-May-12 : Started testing and documenting experiments for the new model. Modifying firmare and Python code whereever required. Some modifications are done to the hardware also. Trying to reach the final PCB at the earliest.
fr: 2012-05-17 : Commncé à tester et à documenter les expériences pour le nouveau modèle. Modification du code firmware et Python pourtout où c'est nécessaire. Quelques modifications sont faites aussi au matériel. On essaie d'arriver au circuit imprimé final le plus tôt possible.

source: Fourier Transform
fr: Transformée de Fourier

source: Short description:
fr: Description courte :

source: Sys-Con Engineering<br/> 53B Mirza Galib Street<br/> Kolkata 700 016<br/> Ph: 09830417377 , 033 40014680<br/> email : sceskm at yahoo.com
fr: Sys-Con Engineering<br/> 53B Mirza Galib Street<br/> Kolkata 700 016<br/> Tél : 09830417377 , 033 40014680<br/> courriel : sceskm at yahoo.com

source: Singing magnet
fr: Aimant chanteur

source: Assembly language programming involves moving data between GPRs, SFRs and RAM, and performing arithmetic and logical operations on the data.
fr: La programmation en langage assembleur implique de déplacer les données entre les GPRs, SFRs et la RAM, et d'effectuer des opérations arithmétiques et logiques sur les données.

source: AC Generator
fr: Générateur de courant alternatif

source: Halfwave Rectifier
fr: Redressement demi-onde

source: Dielectric Constant
fr: Constante diélectrique

source: USBASP is an open sourced ISP (In-System Programming) programmer available from <a href="http://www.fischl.de/usbasp/">http://www.fischl.de/usbasp/</a> . This is provided as an accessory to MicroHOPE due to several reasons. If you want to develop programs that uses the UART of Atmega32, you need to upload code using ISP. USBASP can be used for programming other AVR micro-controllers also. It can be used for burning the boot loader. The LED on the board indicates power. It goes off while uploding code, giving an additional indication.
fr: USBASP est un programme open-source de programmation ISP (In-System Programming) disponible à <a href="http://www.fischl.de/usbasp/">http://www.fischl.de/usbasp/</a>. Il est proposé comme accessoire de microHOPE pour plusieurs raisons. Si on veut développer des programmes utilisant l'UART de l'Atmega32, il faut télécharger le code à l'aide de l'ISP. On peut utiliser USBASP pour programmer d'autres micro-contrôleurs AVR aussi. On peut l'utiliser pour mettre en place le code du chargeur de démarrage (bootloader). La DEL sur la carte signale la présence de l'alimentation. Elle est éteinte durant le téléchargement de code, ce qui donne une indication supplémentaire.

source: The prototype approved by IUAC should be duplicated without changes
fr: Le prototype validé par l'IUAC doit être dupliqué sans modifications.

source: Micro-controllers for Hobby Projects and Education
fr: Micro-contrôleurs pour des projets de loisir et éducatifs

source: Temperature controller
fr: Contrôleur de température

source: Download microhope.zip
fr: Télécharger microhope.zip
