Repository: georgesk/expeyes-web
Catalog: po/*.po
Languages: fr

source: Resistance
fr: Résistance

source: You need to install
fr: Il faut installer

source: This page contains links to various articles and presentations about expEYES and the PHOENIX Project
fr: Cette page contient des liens vers divers articles et présentations au sujet d'expEYES et du projet PHOENIX

source: <a href="images/eyes.pdf">Circuit Schematic</a>
fr: <a href="images/eyes.pdf">Schémas du circuit</a>

source: Full-wave Rectifier
fr: Redressement double alternance

source: Singing Magnet
fr: Aimant chanteur

source: <a href="Documents/Examples/rdecay-euler.py"> rdecay-euler.py</a> : Plot the radioactive decay curve calculated using Euler method of solving differential equation dN/dt = -L * N. <a href="Documents/Images/rdecay-euler.png">screenshot</a>
fr: <a href="Documents/Examples/rdecay-euler.py">rdecay-euler.py</a> : tracé de la décroissnce radioactive calculée à l'aide de la méthode d'Euler pour résoudre l'équation différentielle dN/dt = -L * N. <a href="Documents/Images/rdecay-euler.png">Copie d'écran</a>.

source: Generating beats
fr: Créer des battements

source: RC Network, voltage addition
fr: Réseau RC, addition de tensions

source: Diode IV
fr: Caractéristique IU d'une diode

source: Currently ExpEYES Junior is available at Rs. 2000/- and MicroHOPE at Rs. 700/-<br/> <br/> <span style="font-weight: bold;">Reaching out to more People:</span><br/> ExpEYES is designed by IUAC and it is distributed royalty-free. The software is under GNU GPL. Anybody interested in retailing / manufacture expEYES may contact us. In order ensure quality of the product and user support, the vendors need to meet the following conditions:
fr: ExpEYES Junior est couramment disponible au prix de 2000 roupies - et MicroHOPE à 700 roupies<br/> <br/> <span style="font-weight: bold;">Pour toucher plus de personnes :</span><br/> ExpEYES est conçu par l'IUAC et il est distribué sans royalties. Le logiciel est sous licence libre GNU GPL. Toute personne souhaitant revendre/fabriquer expEYES peut nous contacter. Afin d'assurer la qualité du produit et le support des utilisateurs, les vendeurs doivent satisfaire aux conditions suivantes :

source: The voltage across a capacitor changes linearly when charges through a constant current source. Connect to CCS instead of OD1 and click on CC Charge to get the output shown below. After 3 volts the graph is not linear due to the limitations of the current source.
fr: La tension aux bornes d'un condensateur change linéairement si on utilise une soruce de courant constant. Connecter CCS au lieu de OD1 et cliquer sur CC Charge pour avoir l'affichage présenté ci-dessous. Au-delà de 3 V la courbe n'est plus linéaire à cause de limitations de la source de courant.

source: Channel removed by dragging it to DEL
fr: On efface un canal en le tirant vers DEL

source: AC and DC Separation
fr: Séparation de composantes continue et alternative

source: A frequency divider circuit is wired using the D type Flipflop TTL IC 7474. The schematic and the waveforms are shown below. The output duty cycle is always 50% irrespective of the input waveform dutycycle. The flipflop toggles the output at every rising edge of the clock input.
fr: On câble un diviseur de fréquence à l'aide de bascules de type D, basées sur le circuit TTL 7474. Le schéma et le signal sont montrés ci-dessous. Le rapport cyclique est toujours 50 % quel que soit le rapport cyclique du signal d'entrée. La bascule modifie l'état logique de la sortie à chaque front montant de l'entrée d'horloge.

source: <strong><u>Audio Recording</u></strong>
fr: <strong><u>Enregistrement audio</u></strong>

source: Interference of sound
fr: Interférences sonores

source: Cooling of Water
fr: Refroidissement de l'eau

source: Voltage measured at IN1 (across 1k resistor) = 1.254
fr: Tension mesurée à l'entrée IN1 (à travers une résistance de 1k) = 1,254 v

source: <a href="http://iopscience.iop.org/0031-9120/44/5/002/?rss=1.0">Innovative Science Experiments Using PHOENIX</a>, IOP Physics Education, 2009
fr: <a href="http://iopscience.iop.org/0031-9120/44/5/002/?rss=1.0">Expériences de sciences innovantes utilisant PHOENIX</a>, IOP Physics Education, 2009

source: Temperature sensor ICs , LM35 : 3 pin IC operated at 5 volt. Designed to give an output voltage = Temp in degree Celsius * 10 mV
fr: Circuit capteur de température, LM35: circuit à trois bornes fonctionnant sous 5 V. Prévu pour donner une tension de sortie égale à la température : U = Temp en °C * 10 mV

source: Cooling curve, opaque solutions
fr: Courbe de refroidissement, solution opaque

source: Phase difference of AC waveforms
fr: Déphasage de signaux alternatifs

source: <a href="Documents/Examples/plot-equation.py">plot-equation.py</a> : Plotting Graphs using numpy and matplotlib. The example demonstrates sine(x), you may also try other functions. <a href="Documents/Examples/plot-ncurve.py">screenshot </a>
fr: <a href="Documents/Examples/plot-equation.py">plot-equation.py</a> : tracé de graphiques à l'aide de numpy et matplotlib. L'exemple présente sin(x), on peut aussi essayer d'autres fonctions. <a href="Documents/Examples/plot-ncurve.py">Copie d'écran</a>.

source: Several plug-in boards are also available. <br/>
fr: Plusieurs cartes-filles son aussi disponibles.<br/>

source: <strong>Adding two numbers</strong>
fr: <strong>Addition de deux nombres</strong>

source: Filter Circuits
fr: Circuits de filtrage

source: DC, by filtering PWM waveform
fr: Courant continu, en filtrant un signal en modulation de largeur d'impulsion

source: <span style="color: #ff6600;"><span style="font-weight: bold;">Short Python Programs, based on Higher Secondary Mathematics and Physics topics</span></span>
fr: <span style="color: #ff6600; font-weight: bold;">Programmes Python courts, basés sur des sujets de physique et de mathématiques de lycée</span>

source: FET, DS Characteristic
fr: Transistor à effet de champ, caractéristique DS

source: MCP2200 Driver
fr: Pilote MCP2200

source: Resistance of ionic solutions
fr: Résistance de solutions ioniques

source: 9-May-12: Did several iterations of prototyping. Added a 1mA constant current source with ON/OFF control. Firmware almost done. Wrote a CRO program with extra features. Drawings of the plastic shell given for making the mould. Almost getting ready for production.
fr: 2012-05-09 : Plusieurs itérations de prototypes. Ajout d'une source de courant de 1 mA avec contrôle on/off.

source: For other GNU/Linux Systems:
fr: Pour les autres systèmes GNU/Linux :

source: PT100, Temperature sensor
fr: PT100, capteur de température

source: Python Programming
fr: Programmation Python

source: Interference of ultra-sound
fr: Interférences en ultra-sons

source: <a href="Documents/Examples/product-of-sines.py"> product-of-sines.py</a> : Amplitude modulation by multiplying two sine waves. <a href="Documents/Images/product-of-sines.png">screenshot</a>
fr: <a href="Documents/Examples/product-of-sines.py">product-of-sines.py</a>_: modulation d'amplitude en multipliant deux signaux sinusoïdaux. <a href="Documents/Images/product-of-sines.png">Copie d'écran</a>.

source: Praveen Patil, Department of Physics,G S S College, Tilakwadi, Belgaum 590006
fr: Praveen Patil, Département de Physique, G S S College, Tilakwadi, Belgaum 590006

source: People Involved
fr: Personnes impliquées

source: This mode has several variations like pre and post incrementing of the register or adding an offset to it. Refer to the data book for details.
fr: Ce mode a plusieurs variantes, comme pré et post-incrémentation des registres ou ajout d'un décalage à ceux-ci. Se référer au manuel pour plus de détails.

source: RC Integration &amp; Differentiation
fr: Intégration et différentiation RC

source: Filter Circuit, Frequency &amp; Phase
fr: Circuit de filtre, fréquence et phase

source: The PHOENIX project started in 2005 and many people, both from <a href="http://www.iuac.res.in/indexhighres.html">IUAC</a> and outside, has contributed at various stages. Only those who have worked in developing equipment are mentioned below. Equally important are the numerous members of the academic community who took interest in it and worked for spreading it, by conducting programs and also introducing it to the syllabus at some places.
fr: Le projet PHOENIX a démarré en 2005 et beaucoup de personnes, tant de l'<a href=\"http://www.iuac.res.in/indexhighres.html\">IUAC</a> que de l'extérieur, ont contribué à diverses étapes. Seuls sont mentionnés ci-dessous ceux qui ont travaillé à developper l'équipement. Sont aussi importants les membres de la communauté éducative qui s'y sont intéressés et qui ont travaillé à le faire connaître, en menant des programmes de formation et aussi en l'introduisant dans la formation intiale à certains endroits.

source: Pendulum, Nature of Oscillation
fr: Pendule, nature des oscillations

source: <a href="http://urtalk.kpoint.com/playlist/43/kapsule/gcc-b73217cf-469a-4c52-ad22-e2c40c88bd5d">Presentation at Scipy.in</a>, Dec-2011, IITB, Mumbai
fr: 2011-12-04 : <a href=\"http://urtalk.kpoint.in/playlist/43/kapsule/gcc-b73217cf-469a-4c52-ad22-e2c40c88bd5d\">Présentation à Scipy.in</a>, décembre 2011, IITB, Mumbai ;

source: A voltmeter program
fr: Un programme de voltmètre

source: Join the <a href="http://www.freelists.org/list/phoenix-project"> Phoenix Mailing List </a> to be informed about the <a href="http://www.iuac.res.in/%7Eelab/phoenix/workshops/index.html"> Training Programs </a> and new developments.
fr: Rejoignez la <a href="http://www.freelists.org/list/phoenix-project"> liste de courriel Phoenix</a> pour rester informé des <a href="http://www.iuac.res.in/%7Eelab/phoenix/workshops/index.html"> Programmes de Formation</a> et des nouveaux développement.

source: Working of a half wave rectifier converting AC to DC is demonstrated. Effect of capacitor filter across the output is also shown.
fr: On démontre le fonctionnement d'un système de redressement simple alternance convertissant un courant alternatif en continu. L'effet d'un condensateur de filtrage en parallèle sur la sortie est aussi montré.

source: <code> .section .text ; denotes code section</code> <code> .global __vector_1 ; INT0_vect</code> <code>__vector_1: ; Interrupt Service Routine of INT0. Called when PD2 is LOW.</code> <code> INC R1</code> <code> OUT 0x18, R1</code> <code> RETI ; return from interrupt</code> <code> .global main</code> <code>main:</code> <code> LDI R16, 255</code> <code> OUT 0x17, R16 ; DDRB</code> <code> OUT 0x12, R16 ; enable Port D pull-up resistors</code> <code> LDI R16, 0x40 ; enable</code> <code> OUT 0x3b, r16 ; interrupt INT0</code> <code> CLR R1</code> <code> SEI ; enable interrupts globally</code> <code>loop:</code> <code> RJMP loop ; infinite loop</code> <code> .end</code>
fr: <code> .section .text ; dénote la section de code</code> <code> .global __vector_1 ; vecteur pour INT0</code> <code>__vector_1: ; Sous-programme de service de l'interruption INT0. Appelé quand PD2 est BAS.</code> <code> INC R1</code> <code> OUT 0x18, R1</code> <code> RETI ; retour de l'interruption</code> <code> .global main</code> <code>main:</code> <code> LDI R16, 255</code> <code> OUT 0x17, R16 ; DDRB</code> <code> OUT 0x12, R16 ; active les résistances de tirage du port D</code> <code> LDI R16, 0x40 ; activation</code> <code> OUT 0x3b, r16 ; interrupttion INT0</code> <code> CLR R1</code> <code> SEI ; activation des interruptions globallement</code> <code>loop:</code> <code> RJMP loop ; boucle infinie</code> <code> .end</code>

source: Interrupts, the asynchronous Calls
fr: Interruptions, les appels de sous-programmes asynchrones

source: Other people from IUAC who has contributed to this project are: Jimson Sacharias, Kundan Singh, Parmanand Singh, Deepak Munda and S Venkataramanan.
fr: Les autres personnes de l'IUAC qui ont contribué à ce projet sont : Jimson Sacharias, Kundan Singh, Parmanand Singh, Deepak Munda et S Venkataramanan.

source: OTG cable (the one used for connecting pendrive to tablet) to connect ExpEYES. Works only on Android versions 4.0.0 and above.
fr: Câble OTG (celui qui est utilisé pour relier la clé USB à la tablette) pour connecter expEYES. Ne fonctionne que sur Android version 4.0.0 ou plus.

source: Resistor = 1000 Ohm, Inductor = 300 mH, 5Ohms , Capacitor = 1 uF
fr: Résistance = 1000 Ohm ; inductance = 300 mH ; capacité = 1 µF

source: he infrared signals emitted by the remote controls of TVs etc can be captured using the TSOP1738 IR receiver. The program ir-recv.c uses an interrupt sevice routine to decode this signal. The output of the chip is connected to bit 2 of PORTD, as shown in the figure below. Press some buttons on the remote control panel. The received number will be displayed on the LCD display of microHOPE. The code ir-recv.c, can be modified to work with the single byte IR transmitted from expEYES. The received byte is displayed on the LCD display. Dowload ir-recv.c
fr: Les signaux infrarouges émis par les télécommandes de TV, etc. peuvent être capturés à l'aide du récepteur IR TSOP1738. Le programme ir-recv.c utilise un sous-programme de service d'interruption pour décoder ce signal. La sortie de la puce est connectée au bit 2 de PORTD, comme montré dans le figure ci-dessous. Appuyer sur un bouton quelconque de la télécommande. Le nombre reçu sera affiché sur l'afficheur LCD de microHOPE. le programme ir-recv.c peut être modifié pour fonctionner avec la transmission « simple octet » utilisée par expEYES. L'octet reçu est affiché sur l'écran LCD. Télécharger ir-recv.c

source: Test equipment, the CRO+ program
fr: Matériel de test, le programm CRO+

source: Thermistor
fr: Thermistance

source: We have four I/O ports (A,B,C and D, controlled by 12 SFRs) that can be used for providing input data to our programs and display the output. In order to do that, we need to use switches and LEDs connected to these ports. The following examples use the Digital Output Board (having 8 LEDs) to display program results. The figure shows the board plugged into port B.
fr: On a quatre ports d'entrée/sortie (A, B, C et D, contrôlés par 12 SFRs) qui peuvent être utilisés pour fournir des données d'entrée à nos programmes et afficher les données en sortie. Afin d'y accéder, on a besoin d'utiliser des interrupteurs et des DELs connectés à ces ports. Les exemples suivants utilisent la carte de sortie numérique (qui dispose de 8 DELs) pour afficher les résultats des programmes. La figure montre la carte branchée au port B.

source: The Opening Screen of ExpEYES program
fr: L'écran d'accueil du programme expEYES

source: AC &amp; DC
fr: Courant continu et alternatif

source: The 40 kHz Piezo Transmitter is driven by SQR1. The Receiver output is connected to A1. The phase difference between the driving square wave and the sine wave received at A1 is measured as a function of distance between the transmitter and the receiver.
fr: On pilote le transmetteur piézo 40 kHz par SQR1. La sortie du récepteur est connectée à A1. Le déphasage entre le signal pilote et le signal reçu en A1 est mesuré en fonction de la distance entre émetteur et récepteur.

source: <a href="http://expeyes.in/articles/55/expeyes-junior">ExpEYES Junior</a> is ready. Photograph below shows capturing sound from a Piezo Buzzer.
fr: <a href="http://expEYES.in/articles/55/expEYES-junior">expEYES Junior</a> est prêt. La photo ci-dessous le montre qui capture un son issu d'un buzzer piézo.

source: Fulwave Rectifier
fr: Redressement double alternance

source: ExpEYES ( Experiments for Young Engineers and Scientists) is an Open Hardware and Free Software framework for developing science experiments and classroom demonstrations. This project will work on developing a set of plug-ins for ExpEYES. These plug-ins with GUI's will enhance the scope of ExpEYES for using it to perform several experiments in mechanics, sound and waves. Project will also focus on adding features for using acoustic and motion sensors for various science experiments.
fr: ExpEYES ( Experiments for Young Engineers and Scientists) est un environnement logiciel et matériel libre pour développer des expériences scientifiques et des démonstrations en classe. Ce projet fonctionnera en développant un ensemble de greffons pour expEYES. Ces greffons avec des intrfaces graphiques augmenteront la portée d'expEYES pour l'utiliser dans plusieurs expériences en mécanique, acoustique et physique ondulatoire. Le projet s'attachera aussi à ajouter des fonctionalités pour utiliser des capteurs de son et de déplacement pour plusieurs expériences scientifiques.

source: EYES GUI
fr: Interface grphique EYES

source: Tested by writing the required C and Python programs, like CRO.
fr: Testé en écrivant les programmes requis en C et Python, comme CRO.

source: Requires USB OTG support in hardware and the USB API software in the OS.
fr: Le support d'USB OTG est nécessaire au niveau matériel et dans l'API du pilote USB du système d'exploitation.

source: Data Direct: In this mode, the address of the memory location containing the data is specified, instead of the data itself. LDS R1, 0x60 moves the content of memory location 0x60 to R1. STS 0x61, R1 copies R1 to location 0x61.
fr: <i>Data Direct</i>, accès direct aux données : dans ce mode, l'adresse mémoire contenant la donnée est spécifiée, au lieu de la donnée elle-même. LDS R1, 0x60 copie le contenu de la mémoire d'adresse 0x60 dans R1. STS 0x61, R1 copie R1 à l'adresse 0x61.

source: In the high school classes, we learn about the various branches of mathematics, like geometry, algebra, trigonometry, calculus etc. , without bothering much about their interconnections. Plotting the graphs of different algebraic and trigonometric functions helps understanding them better. Simple numerical methods can demonstrate the connection between algebra and calculus. This knowledge is useful for for exploring the problems in physics in a different manner.
fr: Dans les classes de lycée, on étudie diverses branches des mathématiques, comme la géométrie, l'algèbre, la trigonométrie, le calcul numérique, etc. sans beaucoup s'inquiéter de leurs interconnexions. Le tracé des graphiques de diverses fonctions algébriques et trigonométriques aide à mieux les comprendre. Des méthodes numériques simples peuvent démontrer les connexions entre entre l'algèbre et le calcul numérique. Cette connaissance est utile pour explorer les problèmes en physique de différentes façons.

source: Logic gate
fr: Porte logique

source: expEYES can be used as a test equipment for studying the logic gates. The TTL ICs 7432 &amp; 7408 are powered from OD1. The inputs are provided by SQR1 and SQR2 set at 90deg phase difference. The experimental setup and outputs for AND and OR gates are shown below.
fr: On peut utiliser expEYES comme appareil de test pour l'étude de portes logiques. Les circuits TTL 7432 et 7408 sont alimentés par OD1. Leurs signaux d'entrées sont fournis par SQR1 et SQR2, réglés pour un déphasage de 90°. le montage expérimental et les résultats pour les portes ET et OU sont montrés ci-dessous.

source: Velocity of sound, using 40kHz piezo
fr: Vitesse du son, à l'aide d'un piézo 40 kHz

source: Even though no Android version of expEYES made, the<strong> idea of a very low cost device</strong> came up. I decided to explore the options for lowering the cost further. A design using Atmega328, from Atmel Corp., was made, using built-in 10 bit ADC and PWM DAC. PCB size reduced to 9mm x6 mm
fr: Même si on n'a pas fait de version Android pour expEYES, l'<strong>idée d'un appareil très bon marché</strong> a émergé. J'ai décidé d'explorer les options pour diminuer le coût encore un peu. On a fait une concetion basée sur l'Atmega328, d'Atmel Corp, qui utilise les convertisserseurs analogique-numérique et numérique analogique 10 bit, et la modulation PWM. La taille du circuit imprimé a été réduite à 9mm &times; 6mm.

source: Squarewave to RC circuit, Integration
fr: Signal carré dans un circuit RC, intégration

source: Capacitance
fr: Capacité électrique

source: Acceleration due to gravity can be calculated by measuring the time taken by an object to fall under gravity from a given height. A metal ball is held by an electromagnet powered by OD1. A loudspeaker generates an electrical signal when the ball hits the surface. It is amplified and given to SEN via a PN junction diode. The time from a falling edge on OD1 to a rising edge on SEN is measured using software.
fr: On peut calculer l'accélération de la gravité en mesurant le temps que met un objet soumis à la gravité pour tomber d'une hauteur donnée. Une bille de métal est retenue par un électro-aimant alimenté par OD1. Un haut-parleur produit un signal électrique quand la bille touche la surface. Celui-ci est amplifié et envoyé vers l'entrée SEN à travers la jonction PN d'une diode. La durée depuis le front descendant sur OD1 jusqu'au front montant sur SEN est mesuré par le logiciel.

source: Voltage applied to PVS = 4.0 volts
fr: Tension appliquée au PVS = 4,0 V

source: <a href="Documents/Examples/plot-data-3d.py">plot-data-3d.py</a> : Reads multi-column text data from files and plots the first 3 columns, <a href="Documents/Images/plot-data-3d.png">screenshot</a> shows the data from file.
fr: <a href="Documents/Examples/plot-data-3d.py">plot-data-3d.py</a>_: lecture de texte en colonnes depuis un fichier et tracé de courbe pour les trois première colonnes, <a href="Documents/Images/plot-data-3d.png">voir la copie d'écran</a> ; visualise les données d'un fichier.

source: Transformer
fr: Transformateur

source: 5-Apr-12 : Time measurement routines are almost done. A numbering scheme is worked out to make the functions more generic. A CRO program is running now.
fr: 2012-04-05 : Les routines de mesures temporelles sont pratiquement au point. Un schéma de numérotation est élaboré afin de rendre les fonctions plus génériques. Un programme CRO fonctionne maintenant.

source: Pricing:<br/> The development ExpEYES is done by Inter-University Accelerator Centre, New Delhi. Since the objective of PHOENIX project is to make the products available to maximum number of people, they are kept royalty-free. The cost of expEYES is depends on the cost of raw materials, labour involved, and the sales overheads. The vendors have fixed the Maximum Retail Price considering the expenses and paperwork involved in securing orders and the delay in payments from institutions. However, they will offer discount when payment is done in advance so that individual buyers get it cheaper.
fr: Politique de prix :<br/> Le développement d'expEYES est fait par le « Inter-University Accelerator Centre », New Delhi. Comme l'objectif du projet PHOENIX est de rendre les produits accessibles au nombre maximum d'utilisateurs, il est distribué sans royalties. Le coût d'expEYES dépend du prix des matières premières, du travail nécessaire, et des bénéfices à la vente. Les vendeurs ont fixé le prix maximum conseillé en considérant les dépenses et le travail de sécurisation des factures et des délais dans le paiement par les institutions. Cependant, ils peuvent offrir des réductions si le paiement est fait d'avance, de telle façon que les acheteurs individuels puissent l'avoir meilleur marché.

source: Infrared Receiver
fr: Récepteur infrarouge

source: Several plug-in modules are available for microhope.
fr: De nombreux modules-greffons sont disponibles pour microHOPE.

source: Output of the Assembler
fr: Ce que produit l'assembleur

source: Light Sensing, Photo-transistor
fr: Capteur de lumière, photo-transistor

source: Steady state response of LCR elements to applied AC voltage
fr: Réponse à l'état stationnaire d'éléments RLC auxquels on applique une tension alternative

source: Velocity of sound in air
fr: Vitesse du son dans l'air

source: LM35, Temperature sensor
fr: LM35, capteur de température
