Repository: georgesk/expeyes-web
Catalog: po/*.po
Languages: fr

source: Power an LED with using SQR1 and change its frequency gradually from 1Hz to 50Hz to observe at what frequency the flickering stops. It may depend on the observer and the intensity of light. I felt the flickering stopping at around 40 Hz, and my son says it still flickers at that frequency. Connection: SQR1 --LED-- GND. No need of series resistor since SQR1 comes out via a 100 Ohm resistor.
fr: Alimenter une DEL à l'aide de SQR1 et changer la fréquence progressivement de 1 Hz à 50 Hz pour observer à quelle fréquence le clignotement cesse. Cela peut dépendre de l'observateur et de l'intensité de la lumière. J'ai ressenti l'arrêt du clignotement vers quelques 40 Hz, cependant que mon fils disait que la diode clignotait toujours à cette fréquence. Connexion : SQR1 ---DEL--- GND. Inutile d'ajouter une résistance en série comme SQR1 traverse une résistance de 100 Ohm.

source: References:
fr: Références :

source: Halfwave Rectifier
fr: Redressement demi-onde

source: Two different frequencies are generated on SQR1 and SQR2 and both are connected to passive Piezo buzzers. The sound is captured by the built-in microphone and connected to A1 after amplification. The two sinusoids are added up to give an envelope. The frequency difference between the two sources in the beat frequency.
fr: Deux fréquences différentes sont créées par SQR1 et SQR2 et chacune est connectée à un buzzer piézo passif. Le son est recueilli par le microphone intégré et connecté à A1 après amplification. Les deux sinusoïdes sont additionnées et cela forme une enveloppe. La différence de fréquence entre les deux sources donne la fréquence des battements.

source: Studying Filter
fr: Étude de filtres

source: The sliders on right sides can be used for adding offset to traces.
fr: Les ascenseurs sur le côté droit peuvent être utilisés pour ajouter un décalage aux traces.

source: value of the unknown resistor = 2.746 / 1.254 = 2190 Ohm
fr: valeur de la résistance inconnue = 2,746 / 1,254 = 2190 Ohm.

source: WRE -- Wait for Rising Edge on the selected input
fr: WRE -- Wait for Rising Edge (attente de front montant) sur l'entrée sélectionnée

source: The code we write are translated by the assembler into machine language instructions. Then it is passed on to the Linker to decide the locations to which code and data are to be stored before executing it. The code is stored into the Program memory. Even though the processor starts from location zero on a reset, the linker places the addresses of the interrupt vectors there, then some initialization code and after that our code is placed. You can explore the .lst output to know the details.
fr: Le code qu'on écrit est traduit par l'assembleur en instructions de langage machine. Puis il est passé au relieur (<i>linker</i>) qui décide des adresses où ce code et les données seront stockées avant l'exécution. Le code est stocké dans la mémoire de programme. Même si le processeur commence à l'adresse zéro au redémarrage, le relieur place les adresses des vecteurs d'interruption à cet endroit-là, puis un peu de code d'initialisation et seulement ensuite le code qu'on a écrit. On peut explorer le fichier .lst pour connaître les détails.

source: SQR1, SQR2 or both together with phase shift can be set from top-right window.
fr: On peut régler SQR1, SQR2 séparément ou ensemble, avec un déphasage, à l'aide de contrôles en haut à droite de la fenêtre.

source: <strong>LDI</strong> (Load Immediate) : used to load a constant value to one of the registers R16-31 ( that's a restriction. load immediate can't work with R1 ro R15)
fr: <strong>LDI</strong> Chargement immédiat (<i>Load Immediate</i>) : utilisé pour charger une valeur constante dans un des registres R16-31 ( c'est une restriction : le chargement immédiat ne fonctionne pas avec les registres R1 à R15)

source: <a href="Documents/Examples/pos-time-plot-euler.py">pos-time-plot-euler.py</a> : One dimensional motion. Velocity and initial position given. Use Euler integration to plot x(t) . <a href="Documents/Images/pos-time-plot-euler.png">screenshot</a>
fr: <a href="Documents/Examples/pos-time-plot-euler.py">pos-time-plot-euler.py</a> : déplacement uni-dimensionnel. On donne la position et la vitesse initiales. Utilisation de l'intégration d'Euler pour tracer x(t). <a href="Documents/Images/pos-time-plot-euler.png">Copie d'écran</a>.

source: gravity by TOF
fr: gravité par temps de vol

source: Phase Shift of AC, RC Circuits
fr: Déphasage du courant alternatif, circuits RC

source: How to Buy
fr: Où acheter

source: AC Circuits
fr: Circuits en courant alternatif

source: Light Barrier
fr: Barrière lumineuse

source: Dielectric Constant
fr: Constante diélectrique

source: Can call programs for different experiments from a popup menu.
fr: Possibilité d'appeler les programmes pour diverses expériences depuis un menu déroulant

source: Videos on using the GUI: <a href="https://www.youtube.com/watch?v=uCOGrrcaS_A">video1</a> <br/>
fr: Vidéos sur l'utilisation de l'interface graphique : <a href="https://www.youtube.com/watch?v=uCOGrrcaS_A">vidéo1</a> <br/>

source: Electromagnetic Induction
fr: induction électromagnétique

source: Reducing the Total cost (ExpEYES + the Computer) has been one of our goals. ExpEYES was tested earlier on the <a href="https://www.youtube.com/watch?v=oMFFx91vdKI">Aakash2 tablet</a> running GNU/Linux. However most of the tablets currently available in the market comes with Android installed. The Android version of the ExpEYES software makes use of that to reduce the total cost. It can also be installed from <a href="https://play.google.com/store/search?q=expeyes&amp;c=apps">Google play store</a>.
fr: Un de nos buts a été de réduire le coût total (expEYES + ordinateur). expEYES a été testé plus tôt sur la <a href="https://www.youtube.com/watch?v=oMFFx91vdKI">tablette Aakash2</a> sous GNU/Linux. Cependant la plupart des tablettes disponibles couramment viennent avec Android pré-installé. La version Android du logiciel expEYES se sert de ça pour réduire le coût total. On peut aussi l'installer à partir du <a href="https://play.google.com/store/search?q=expEYES&amp;c=apps"> Google play store</a>.

source: Clicking on any of the Input Source (A1 to SQ2) will read the voltage and display it in the message area.
fr: Si on clique sur n'importe quelle source de signal d'entrée (A1 jusqu'à SQ2), la tension sera lue et affichée dans la zone des messages.

source: The include files are listed below:
fr: Les fichiers à inclure sont listés ci-dessous :

source: import expeyes.eyesj, sys<br/> p = expeyes.eyesj.open()<br/> p.set_sqr1(0) # set SQR1 HIGH to light LED<br/> for k in range(10):<br/> print p.multi_r2rtime(0,1) # Rising edge to rising edge on comparator output, skip one edge in between
fr: import expeyes.eyesj, sys<br/> p = expeyes.eyesj.open()<br/> p.set_sqr1(0) # signal HAUT sur SQR1 pour allumer la DEL<br/> for k in range(10):<br/> print p.multi_r2rtime(0,1) # Front montant à front montants, sur la sortie du comparateur, on saute un front sur deux

source: To study nature of oscillations of a pendulum, we need to measure the angular displacement as a function of time. Since angle encoders are expensive, we have used a DC motor, that gives a voltage proportional to the angular velocity. Fitting this curve also gives the period of oscillation of the pendulum.
fr: Pour étudier la nature des oscillations d'un pendule, il faut mesurer le déplacement angulaire en fonction du temps. Comme les encodeurs angulaires sont chers, on a untilisé un moteur en courant continu, qui donne une tension proportionnelle à la vitesse angulaire. Si on modélise cette courbe on obtient aussi la période des oscillations du pendule.

source: Temperature Monitor &amp; Control
fr: Moniteur et contrôleur de température
