Repository: georgesk/expeyes-web
Catalog: po/*.po
Languages: fr

source: 23-May-12: The first lot of PBCs send for fabrication, asked the vendor in Delhi to start making some sample pieces. Stopped work for two weeks, programs at JIT, Coimbatore and NIT, Calicut.
fr: 201-05-23 : Premier lot de circuits imprimés envoyé à la fabrication, demandé au vendeur à Delhi de faire quelques échantillons. Arrêt du travail pour deux semaines, programmes au JIT, Coimbatore et NIT, Calicut.

source: Velocity of Sound
fr: Vitesse du son

source: The SFRs are also mapped into the memory space to locations 20hex to 5Fhex. Due to this reason you can use <strong>STS</strong> (Store Direct to SRAM) instruction instead of <strong>OUT</strong> but to a different address. <strong>OUT 0x17, R16</strong> and <strong>STS 0x37, R16</strong> achieves the same result but the former is compact.
fr: Les SFRs sont assi affectés dans l'espace d'adressage de la mémoire aux adresses comprises entre 20hex et 5Fhex. À cause de ça, on peut utiliser des instructions <strong>STS</strong> (Store Direct to SRAM) au lieu de <strong>OUT</strong>, mais à une adresse différente. <strong>OUT 0x17, R16</strong> et <strong>STS 0x37, R16</strong> arrive au même résultat mais la première expression est plus compacte.

source: All the external connections to the micro-controller are done through the four external connectors. In addition to the I/O port pins, Ground and the 5 volt supply from USB are available on each connector.
fr: Toutes les connexions vers le micro-contrôleur sont faites à travers les quatre connecteurs externes. En plus des bornes des ports d'entrée/sortie, la masse et l'alimentation 5 V de la prise USB sont disponibles sur chaque connecteur.

source: Clicking on 'Assemble' and then 'Upload' should make all the LEDs light up.
fr: Si on clique sur « Assembler » et « Télécharger » on devrait voir les DELs s'allumer.

source: The transient response of LCR circuit is studied by applying a 5-&gt;0 volts step and measuring the voltage change across the capacitor. Resonant frequency and damping are extracted by fitting the data with the equation of a damped sinusoid. For and inductor of 130 mH (with a coil resistance of around 600 Ohms) and a capacitor of 0.1 uF, the circuit shows under-damped response.
fr: La réponse transitoire d'un circuit RLC est étudiée en appliquant un échelon de tension 5-&gt;0 V et en mesurant l'évolution de la tension aux bornes du condensateur. On extrait la fréquence de résonnance et l'amortissement en modélisant les données avec l'équation d'une sinusoïde amortie. Pour une inductance de 130 mH (avec une résistance du bobinage de quelques 600 Ohm) et un condensateur de 0,1 µF, le circuit présente une réponse sous-amortie.

source: Microsecond timing resolution.
fr: Résolution temporelle d'une microseconde.

source: Assembler Examples
fr: Exemples en assembleur

source: 4-Dec-2011 : <a href="http://urtalk.kpoint.in/playlist/43/kapsule/gcc-b73217cf-469a-4c52-ad22-e2c40c88bd5d">Gave a demo</a> of expEYES at Scipy.in 2011
fr: 2011-12-04 : <a href=\"http://urtalk.kpoint.in/playlist/43/kapsule/gcc-b73217cf-469a-4c52-ad22-e2c40c88bd5d\">Fait une démo</a> d'ExpEUES à Scipy.in 2011

source: <img alt="" src="images/R2Rsound1.jpg" style="float:right; margin:10px; width: 399px; height: 299px;"/> Microhope can be programmed to act as a USB sound card. The following programs demonstrate how a WAV file can be streamed to microhope and played using the R-2R DAC plugin board (homemade R-2R ladder shown in photo), and also how audio can be sampled by microhope and sent to the PC to be stored as a WAV file. An expEYES is used to see the waveform generated by the <a href="plugins.html">R-2R DAC</a>
fr: <img alt="" src="images/R2Rsound1.jpg" style="float:right; margin:10px; width: 399px; height: 299px;"/> Microhope peut être programmé pour fonctionner comme une carte son USB. Les programmes suivants démontrent comment envoyer un fichier WAV vers microHOPE et le jouer à l'aide de la carte fille convertisseur numérique-analogique R-2R (échelle R-2R fabriquée maison, montrée sur la photo), et aussi comment échantillonner un signal audio grâce à microHOPE puis l'envoyer au PC pour l'y enregistrer comme un fichier WAV. On utilise un boîtier expEYES pour visualiser le signal généré par le <a href="plugins.html">convertisseur numérique-analogique R-2R</a>

source: Plugins for ExpEYES
fr: Greffons pour expEYES

source: The trigger source is selected by dragging <span style="color:#0000ff;">ATR</span> to the desired input source.
fr: On choisit la source pour le trigger en tirant <span style="color:#0000ff;">ATR</span> vers l'entrée de signal désirée.

source: Study AND Gate &amp; OR Gate
fr: Étude d'une porte ET, d'une porte OU

source: To manipulate data, we need to bring them into the GPRs (R1 to R31) and the results should be put back into the memory locations. There are different modes of transferring data between the GPRs and the memory locations, as explained below.
fr: Pour manipuler les données, il faut les amener dans les GPRs (R1 à R31) puis les résultats doivent être remis dans des emplacements de mémoire. Il y a divers modes de transferts de données entre les GPRs et les adresses en mémoire, comme expliqué ci-dessous.

source: <a href="Documents/Examples/integrate-scipy-quad.py">integrate-scipy-quad.py</a> : Calculate the area under an arc of unit radius from x=0 to 1, using scipy.integrate.quad() function
fr: <a href="Documents/Examples/integrate-scipy-quad.py">integrate-scipy-quad.py</a> : calcul de l'aire sous un arc de rayon unité de x=0 à 1, à l'aide de la fonction scipy.integrate.quad()

source: The Oscilloscope Screen
fr: L'écran de l'oscillographe

source: SHI -- Set HIGH on the selected Digital Output (OD1 or CCS)<br/> SLO -- Set LOW on the selected Digital Output (OD1 or CCS)<br/> HTP -- High True Pulse (0V-5V-0V) on the selected Digital Output (OD1 or CCS)<br/> LTP -- Low True Pulse (5V-0V-5V) on the selected Digital Output (OD1 or CCS)
fr: SHI -- Set HIGH (régler à HAUT) la sortie numérique sélectionnée (OD1 ou CCS)<br/> SLO -- Set LOW (régler à BAS) la sortie numérique sélectionnée (OD1 ou CCS)<br/> HTP -- High True Pulse (impulsion HAUTE 0V-5V-0V) à la sortie numérique sélectionnée (OD1 ou CCS)<br/> LTP -- Low True Pulse (impulsion BASSE 5V-0V-5V) à la sortie numérique sélectionnée (OD1 ou CCS)<br/>

source: EM Induction
fr: Induction électromagnétique

source: People
fr: L'équipe

source: Transient Response of RL circuits
fr: Réponse transitoire de circuits RL

source: MicroHOPE Library
fr: Bibliothèque microHOPE

source: You can program AVR series ICs using the USBASP programmer, by connecting them as shown in the figure. There are 6 external connections to the board. Groung and 5 volt supply are connected by insering two wires. The remaining 4 connections are made using four numbers 1mm square pins, one end to the bread board and the other to the USBASP board socket.
fr: On peut programmer les circuits de la série AVR à l'aide du programmateur USBASP, en les connectant comme expliqué sur la figure. Il y a 6 connexions externes sur la carte. La masse et l'alimentation 5 V sont connectées en insérant deux fils. Les connexions restantes sont faites en utilisant quatre broches carrées de 1mm, une extrémité sur la carte et l'autre dans le connecteur USBASP.

source: Transistor CE Characteristic
fr: Caractéristique CE de transistor

source: Let us start with a small program shown below (<a href="microhope/ASM/immed.S"><strong>immed.S</strong></a> is included in the examples provided.)
fr: Commençons avec le petit programme montré ci-dessous (<a href="microhope/ASM/immed.S"><strong>immed.S</strong></a> est inclus dans les exemples fournis)

source: <a href="Documents/Examples/Efield-plot.py">Efield-plot.py</a> : Plots the electric field produced by several point charges located in a plane. <a href="Documents/Images/Efield-plot.png">screenshot</a>
fr: <a href="Documents/Examples/Efield-plot.py">Efield-plot.py</a> : tracé du champ électrique produit par plusieurs charges ponctuelles situées dans un plan. <a href="Documents/Images/Efield-plot.png">Copie d'écran</a>.

source: Bit 0 : Carry
fr: Bit 0 : Retenue (<i>Carry</i>)

source: The main features of CRO+ are:
fr: Les caractéristiques principales de CRO+ sont :

source: <a href="microhope/">Examples Directory</a> as <a href="microhope.zip">zip file</a>
fr: Catalogue d'exemples sous forme de <a href="microhope.zip">fichier zip</a>

source: 8-Apr-12: Having trouble with Charge Time Measurement Unit of PIC micro. A = 5.5 uA, 48.6 uA &amp; 451 uA in 3 different ranges, measured using DMM. With 10x CRO probe connected V =1.25 after feeding 5.5 uA for 10 usecs. Error reported but no solution yet.
fr: 2012-04-08 : des difficultés avec l'unité de mesure de temps de chargement du micro PIC. I = 5,5 µA, 48,6 µA &amp; 451 µA pour trois calibres différents, mesurés avec DMM. Avec une sonde d'oscillo 10&times;, U=1,25 après l'envoi de 5,5 µA pendant 10 µs. L'erreur a été signalée, mais pas de solution pour le moment.

source: Generating Sound, Piezo disc
fr: Créer un son, disque piézo

source: Compact, <span class="medium-blue">8.6x5.8x1.6 cm, 60 gm.</span>
fr: Compact, <span class="medium-blue">8,6&times;5,8&times;1,6 cm, 60 g.</span>

source: The temperature sensor IC LM35 is used for measuring temperature. The voltage output is 0 at 0 degree Celsius and increases 10 mV per degree Celsius. The output of LM35 is connected to ADC channel 0. The program temp-monitor-LM35.c reads the ADC in a loop and displays the result on the LCD. The internal 2.56 volts reference is selected. The program can be easily modified to implement temperature control. The program temp-control-LM35.c assumes that the heater control is done by PB0, configured as digital output.
fr: Le capteur de température LM35 est utilisé pour mesurer la température. La tension est 0 à 0°C et augmente de 10 mV par degré Celsius. La sortie du LM35 est connectée à l'entrée analogique 0. Le programme temp-monitor-LM35.c lit le convertisseur analogique-numérique en boucle et affiche le résultat sur un écran LCD. On sélectionne la référence interne de 2,56 V. On peut modifier aisément le programme pour implémenter un contrôle de température. Le programme temp-control-LM35.c suppose que le contrôle de l'élément chauffant est réalisé par PB0, configuré comme sortie numérique.

source: Open Hardware and Free Software.
fr: Matériel ouvert et logiciel libre.

source: A tool for learning science by exploring and experimenting.
fr: Un outil pour apprendre les sciences par l'exploration et l'expérimentation.

source: Let us modify the previous program to evaluate 255 + 1. The result will be shown on port B and the status flag register SREG on port A.
fr: Modifions le programme précédent pour évaluer 255 + 1. Le résultat sera envoyé au port B et le drapeau de statut SREG sur le port A.

source: Transistor Amplifier
fr: Amplificateur à transistor

source: Transistor Ib Vs Ic
fr: Caractéristique d'un transitor : courant de base, courant de collecteur

source: ExpEYES is from the <a href="http://www.iuac.res.in/%7Eelab/phoenix/">PHOENIX</a> project of <a href="http://www.iuac.res.in/">Inter-University Accelerator Centre</a>,New Delhi. It is a hardware &amp; software framework for developing science experiments, demonstrations and projects without getting in to the details of electronics or computer programming. It converts your PC into a science laboratory. PHOENIX (Physics with Home-made Equipment and Innovative Experiments) project was started, in 2005 as a part of IUAC's outreach program, with the objectives of developing affordable laboratory equipment and training teachers. Design of ExpEYES combines the real-time measurement capability of micro-controllers with the ease and flexibility of <a href="python.html"> Python programming language </a> for data analysis and visualisation. It also functions as a test equipment for electronics hobbyists and engineering students. Software for all products from PHOENIX are distributed under GNU General Public License. The hardware designs are open and royalty-free <a href="hardware.html">commercial production</a> is allowed. The current version was <a href="ej-history.html">released in Aug-2012</a>. <br/>
fr: expEYES est produit par le projet <a href="http://www.iuac.res.in/%7Eelab/phoenix/">PHOENIX</a> du <a href="http://www.iuac.res.in/">Inter-University Accelerator Centre</a>, New Delhi. C'est un ensemble de matériel et de logiciel pour développer des expériences scientifiques, des démonstrations et des projets sans rentrer dans les détails de l'électronique ou de la programmation d'un ordinateur. Il convertit votre PC en un laboratoire de sciences. Le projet PHOENIX (Physics with Home-made Equipment and Innovative Experiments) a démarré en 2005 dans le cadre du programme de vulgarisation de l'IUAC, avec pour objectif de développer des équipements de laboratoire à bon marché et de former les professeurs. La conception d'expEYES combine la capacité de mesures en temps réel des micro-contrôleurs avec l'aisance et la flexibilité du <a href="python.html">langage de programmation Python</a> pour l'analyse et la visualisation de données. Il sert aussi de système de tests pour les bricoleurs et les étudiants ingénieurs. Le logiciel pour tous les produits de PHOENIX est distribué sous licence libre GNU General Public License. La conception du matériel est ouverte et sans royalties, la <a href="hardware.html">production commerciale</a> est autorisée. La version courante a été <a href="ej-history.html">créée en août 2012</a>. <br/>

source: Sound from a Magnet
fr: Faire un son avec un aimant

source: Absorbtion of light in solutions
fr: Absorption de lumière dans des solutions

source: Click on the icons below for information about some of the experiments performed and documented.
fr: Cliquez sur les icones ci-dessous pour des informations au sujet de quelques-unes des expériences présentées et documentées.

source: The voltage induced across a solenoid coil when a magnet passes through it can be captured and analyzed.
fr: La tension induite dans un solénoïde quand un aimant la traverse peut être capturée et analysée.

source: <a href="MicroHOPE/usbasp.html">USBASP</a> programmer
fr: programmeur <a href="MicroHOPE/usbasp.html">USBASP</a>

source: <a href="http://www.python.org/">Python</a> is an interpreted language with an easy to learn syntax and has very good libraries for graphics, networking, scientific computation etc. It is freely downloadable and available on almost all operating systems. The Phoenix project uses Python for developing all the code except the one running on the micro-controller. There are so many books available on Internet for learning Python. The book <a href="http://www.iuac.res.in/%7Eelab/expeyes/Documents/mapy.pdf">Python for Education</a> tries to introduce Python as a tool for learning Science &amp; Mathematics. To run and modify the examples given in this book, a code browser program also is available as a Debian package.
fr: <a href="http://www.python.org/">Python</a> est un langage interprété avec une syntaxe facile à apprendre et disposant de très bonnes bibliothèques graphiques, pour les réseaux, pour le calcul scientifique, etc. Il est librement téléchargeable et disponible pour pratiquement tous les systèmes d'exploitation. Le projet PHOENIX utilise Python pour le développement de tout le code sauf celui qui fonctionne sur le micro-contrôleur. Il y a de nombreux libres disponibles sur Internet pour apprendre Python. Le livre <a href="http://www.iuac.res.in/%7Eelab/expeyes/Documents/mapy.pdf">Python for Education</a> essaie d'introduire Python comme outil pour apprendre les sciences et les mathématiques. pour faire tourner et modifier les exemples donnés dans ce livre, un programme navigateur de code est disponible sous forme de paquet Debian.

source: <code>COM R16 ; Complement</code> <code>NEG R16 ; 2's complement</code> <code>TST R16 ; test for zero or minus</code> <code>AND R16, R17 ; bitwise AND</code> <code>OR R16, R17 ; bitwise OR</code> <code>ADD R16, R17 ; summing</code>
fr: <code>COM R16 ; Complément</code> <code>NEG R16 ; Complément à deux</code> <code>TST R16 ; test pour zéro ou négatif</code> <code>AND R16, R17 ; ET bit à bit</code> <code>OR R16, R17 ; OU bit à bit</code> <code>ADD R16, R17 ; addition</code>

source: WFE -- Wait for Falling Edge on the selected input
fr: WFE -- Wait for Falling Edge (attente de front descendant) sur l'entrée sélectionnée

source: Programmer's Manual. Download from <a href="http://www.iuac.res.in/%7Eelab/expeyes/Documents/eyesj-progman.pdf"> here </a> (or <a href="Documents/eyesj-progman.pdf">here</a>)
fr: Le manuel du programmeur. À télécharger depuis <a href="http://www.iuac.res.in/%7Eelab/expEYES/Documents/eyesj-progman.pdf"> ici</a> (ou <a href="Documents/eyesj-progman.pdf">ici</a>)

source: ExpEYES can be used to study the effect of resistive, inductive and capacitive elements in an AC circuit. L,C and R are connected in series. The total voltage and the voltage across the resistor are measured as a function of time. The voltage across LC is obtained by subtracting the voltage across R from the total. The phase relationships and the vector diagrams are graphically displayed.
fr: On peut utiliser expEYES pour l'étude d'éléments résistifs, inductifs et capacitifs en alternatif. On connecte R, L et C en série. La tension totale et la tension aux bornes de la résistance sont mesurées en fontion du temps. La tension aux bornes de l'association LC est obtenue par soustraction de la tension aux bornes de R du total. Le déphasage et le diagramme des vecteurs de Fresnel sont présentés sous forme graphique.

source: <a href="Documents/Examples/mass-spring-scipy.py">mass-spring-scipy.py</a> : Solve the mass on a spring system using scipy.integrate.odeint(). <a href="Documents/Images/mass-spring-scipy.png">screenshot</a>
fr: <a href="Documents/Examples/mass-spring-scipy.py">mass-spring-scipy.py</a> : solution pour un ressort avec masse à l'aide de scipy.integrate.odeint(). <a href="Documents/Images/mass-spring-scipy.png">Copie d'écran</a>.

source: Pendulum, Value of 'g'
fr: Pendule, valeur de « g »

source: News
fr: Nouveautés

source: 1-Apr-2012: Received a mail from Myra Vanlnwegen, education coordinator for the <a href="http://www.raspberrypi.org/">Raspberry Pi</a> Foundation, asking whether expEYES work with Raspberry Pi. Requested her to send one Rpi board.
fr: 2012-04-01 : Reçu un e-mail de Myra Van Inwegen, coordinatrice d'éducation pour la fondation <a href=\"http://www.raspberrypi.org/\">Raspberry Pi</a>, qui demandait si expEYES fonctionne avec Raspberry Pi. Je lui ai demandé d'envoyer une carte Raspberry Pi.

source: Programming ATmega32 in assembly
fr: Programmer l'ATmega32 en assembleur

source: USBASP Programmer
fr: Programmeur USBASP

source: <a href="http://www.pi-supply.com/product-category/raspberry-pi-add-on-boards/phoenix/">Pi-Supply</a><br/> Kent<br/> United Kingdom<br/> Phone : 01732590665<br/> email: sales at pi-supply.com <br/>
fr: <a href="http://www.pi-supply.com/product-category/raspberry-pi-add-on-boards/phoenix/">Pi-Supply</a><br/> Kent<br/> United Kingdom<br/> Tél. : 01732590665<br/> Courriel : sales at pi-supply.com <br/>

source: <a href="Documents/Examples/accn-vel-from-pos.py"> accn-vel-from-pos.py</a> : Calculate acceleration and velocity from position data. <a href="Documents/Images/accn-vel-from-pos.png">screenshot</a>
fr: <a href="Documents/Examples/accn-vel-from-pos.py">accn-vel-from-pos.py</a> : calcul de l'accélération et de la vitesse à partir de données de position. <a href="Documents/Images/accn-vel-from-pos.png">Copie d'écran</a>.

source: Phase shift calculated using the above values is 40.8 deg (calculator on the right bottom side) and the measured Phase shift is 40.1 deg, well within the tolerance values of the components.
fr: Le déphasage calculé en utilisant les valeurs ci-dessus est 40,8° (calculatrice en bas à droite) et le déphasage mesuré est 40,1°, bien en accord avec les valeurs des tolérances des composants.

source: All the examples below have <span style="font-weight: bold;">less than 20 lines</span> of Python code, excluding empty lines and comments. If any example exceeds 20 lines, you will find a shorter version also given.
fr: Tous les exemples ci-dessous ont <b>moins de 20 lignes</b> de code Python, compte non tenu des lignes vides et des commentaires. Si un quelconque exemple dépasse les 20 lignes, on trouvera aussi une version plus courte.

source: <a href="Code/main.c">C Code</a> and <a href="Code/asm.s">Assembler Code</a>, on the micro-controller
fr: <a href="Code/main.c">le Code C</a> et <a href="Code/asm.s">le code Assembleur </a>, sur le micro-contrôleur

source: Sound Beats
fr: Battements sonores

source: To copy the examples to a directory named 'microhope' inside your home directory run:<br/> $ create-microhope-env
fr: Pour copier les exemples dans un répertoire nommé "microhope" dans votre répertoire personnel lancez :<br/> $ create-microhope-env

source: Started looking for micro-controllers with built-in USB, 12bit ADC and 2k RAM. Found PIC18F2458, from Microchip Inc., having both. After contacting Microchip, it was realised that the built-in USB cannot be used simultaneously with the real-time measurements required. Changed to PIC18F25KA80 + MCP2200 combination. Vinod &amp; Pramode did ADC &amp; UART testing of PIC18F2458. Almost decided to go for a PIC controller.
fr: Commencé à chercher des micro-contrôleurs avec l'USB implémenté, un DAC 12 bit et 2k de RAM. Trouvé le PIC18F2458, de Microchip Inc., qui ales deux. Après un contact avec Microchip, on a réalisé que l'USB intégré ne pouvait pas être utilisé em même temps que les mesures en temps réel nécessaires. Changé pour une combinaison de PIC18F25KA80 + MCP2200. Vinod &amp; Pramode ont fait les tests de l'ADC &amp; UART du PIC18F2458. Pratiquement décidé de partir pour un contrôleur PIC.

source: 18-Feb-12 : Received PICKIT3 programmer and PIC24FV32KA302 chips. Surface mount package was ordered by mistake, instead of DIP, but tested them using PICKIT3 somehow. Started testing the PCB from the beginning of Mar-12, facing problems mostly due to lack of familiarity with PIC uCs. Thanks to the cooperation from Microchip things are getting sorted out. Solving a UART error took days, to realize that the watchdog timer is enabled by default.
fr: 2012-02-18 : Reçu le programmeur PICKIT3 et les puces PIC24FV32KA302. Un kit de montage en surface a été commandé par erreur, au lieu de composants DIP, mais on les a testés avec PICKIT3 cependant. Début du test du circuit imprimé de puis le début de mars 2012, apparition de problèmes principalement dus au manque de familiarité avec les microcontrôleurs PIC. Grâce à la coopération de Microchi les choses s'arrangent. Il a fallu des jours pour résoudre une erreur UART, avant de réaliser que le timer watchdog est activé par défaut.
