Repository: georgesk/expeyes-web
Catalog: po/*.po
Languages: fr

source: The AC mains supply waveform can be plotted by using a piece of wire as an antenna (NO direct contact with AC power line). The frequency is extracted from the captured waveform, by fitting it with the equation of a sinusoid. Connect one end of a long piece of wire to A0 and let the other end float near a power line. The amplitude of the signal will depend upon the length of the wire and its proximity to the power line. Try doing this using a laptop, far away from AC power lines.
fr: La tenson alternative du secteur peut être observée en utilisant un morceau de fil électrique comme antenne (PAS DE CONTACT direct avec les fils électriques du secteur !). On extrait la fréquence du signal capturé, en le modélisant avec une fonction sinusoïdale. Connecter une extrémité d'un fil électrique long à l'entrée A0 et laisser l'autre extrémité pendre près d'un câble branché à la tension du secteur. L'amplitude du signal dépend de la longueur du fil et de sa proximité avec le câble électrique. On peut essayer de le faire avec un ordinateur portable, loin de câbles électriques.

source: Two variable voltages are required to measure the Common Emitter characteristic of a transistor, for the collector and the base. The PVS output is connected to the collector through a 1k resistor. A DC voltage is generated by operating the SQR1 in Pulse Width Modulated mode. The output is filtered using an RC circuit (R=200k, C=100uF) . This voltage is applied to the base of the transistor. PVS is varied and the collector voltage is plotted against the collector current for different base currents. Base current is calculated by (SQR1 out - 0.65)/200k .
fr: Il faut deux tensions variables pour mesurer la caractéristique en émetteur commun d'un transistor, une pour le collecteur et une pour la base. la sortie PVS est connectée au collecteur via une résistance de 1k. Une tension continue est créée en faisant fonctionner SQR1 en mode rapport cyclique variable. Sa sortie est filtrée à l'aide d'un circuit RC (R = 200 k, C = 100 µF). Cette tension est appliquée à la base du transistor. On varie la tension du PVS, et on trace la coube de la tension de collecteur en fonction du courant de collecteur pour diverses valeurs du courant de base. Le courant de base se calcule comme (sortie de SQR1 - 0.65)/200k).

source: Colpitt Oscillator
fr: Oscillateur de ColPitt

source: <a href="Documents/Examples/sum-of-sines.py">sum-of-sines.py</a> : Sum of two sine waves result in beats. <a href="Documents/Images/sum-of-sines.png" title="Beats">screenshot</a>.
fr: <a href="Documents/Examples/sum-of-sines.py">sum-of-sines.py</a> : la somme de deux signaux sinusoïdaux donne des battements. <a href="Documents/Images/sum-of-sines.png" title="Beats">Copie d'écran</a>.

source: Design
fr: Conception

source: Audio Playback and Recording
fr: Enregistrement et restitution audio

source: Due to his efforts expEYES software is now part of Debian GNU/Linux and it's derivatives like Ubuntu. He did the localisation of software and documentation, French versions are already available, Created a logo. Introduced PHOENIX in Europe, first using in his school, then took to others, resulted in a <a href="http://hackable-devices.org/shop/product/expeyes">retailer for expEYES</a> there. Manages the <a href="https://github.com/expeyes">expEYES resository</a> on github. Suggested a lot of creative ideas for the project.
fr: Grâce à ses efforts, le logiciel expEYES fait maintenant partie de Debian GNU/Linux et de ses dérivés comme Ubuntu. A fait l'internationalisation puis la localisation en français du logiciel et de la documentation, des versions en français sont actuellement disponibles, créé un logo. A introduit PHOENIX en Europe, en l'utilisant le premier dans son lycée, puis en le montrant à d'autres, ce qui a eu pour résultat <a href="http://hackable-devices.org/shop/product/expeyes">un revendeur pour expEYES</a> local. Gère le <a href="https://github.com/expeyes">dépôt expEYES</a> sur github. A suggéré plusieurs idée créatives pour le projet.

source: <b>Alphanumeric LCD board</b>:<br/> For some applications, it is necessary to have a local display. The HD44780 controller, or compatible IC, based LCD displays are widely available. They come with a 16 pin connector and the transfer protocol is well documented For details refer to . The connections between microHOPE and the LCD display are shown in figure. Pins 4,5 and 7 of the LCD display are control lines, connected to PC1, PC2 and PC4. The ASCII codes are transferred in the 4bit mode, using pins 11 to 14 connected to PC4, PC5, PC6 and PC7. The LCD should be connected to port C socket, to use the C library functions to access the display.
fr: <b>Carte LCD alpha-numérique :</b><br/> Pour certaines applications, il est nécessaire de disposer d'un afficheur local. Les afficheurs LCD basés sur un contrôleur HD44780, ou compatible, sont disponibles largement. Ils ont un connecteur à 16 broches et le protocole de transfert est bien documenté. Pour les détails, se référer à . Les connexions entre microHOPE et l'afficheur LCD sont montrés dans la figure. Les broches 4, 5 et 7 de l'écran LCD sont les lignes de contrôle, connectées à PC1, PC2 et PC4. les codes ASCII sont transférés dans le mode 4 bit, à l'aide des broches 11 à 14, connectées à PC4, PC5, PC6 et PC7. La carte LCD doit être connectée au connecteur du port C, afin d'utiliser les fonctions des bibliothèques pour accéder à l'afficheur.

source: RC integration
fr: Intégration RC

source: Bit 5 : Half Carry
fr: Bit 5 : demi retenue (Half Carry)

source: 555 monoshot
fr: Monostable 555

source: IR Receiver
fr: Récepteur IR

source: For Debian/Ubuntu systems:
fr: Pour les systèmes Debian/Ubuntu :

source: 20-Mar-12 : C language code failed to meet the 100 ksamples/sec rate for ADC blockread. Started learning PIC24 assembly language, great help from the <a href="http://my.safaribooksonline.com/book/electrical-engineering/semiconductor-technology/9781584505839/introduction-to-the-pic24-microcontroller-family/ch03lev1sec5#X2ludGVybmFsX0ZsYXNoUmVhZGVyP3htbGlkPTk3ODE1ODQ1MDU4MzkvNzg=">online book</a> by Robert Reese, Bryan Jones and J. W. Bruce.
fr: 2012-03-20 : le code en langage C échoue à réaliser la vitesse de transmission de 100 kéch/s pour la lecture en bloc de conversion analogique-numérique. Commencé à apprendre le langage assembleur PIC24, beaucoup d'aide du <a href=\"http://my.safaribooksonline.com/book/electrical-engineering/semiconductor-technology/9781584505839/introduction-to-the-pic24-microcontroller-family/ch03lev1sec5#X2ludGVybmFsX0ZsYXNoUmVhZGVyP3htbGlkPTk3ODE1ODQ1MDU4MzkvNzg=\">livre en ligne</a> de Robert Reese, Bryan Jones et J. W. Bruce.

source: MicroHOPE is a micro-controller development system based on Atmel ATmega32. Developed by IUAC, New Delhi, and released as open hardware. Unlike many other systems, the focus is on understanding the fundamentals of micro-controller architecture and programming rather than learning the features of the development kit. The knowledge gained on Atmega32 using MicroHOPE can be easily applied in understanding another micro-controller. There is no complex IDE for MicroHOPE. A simple text editor with a couple of extra buttons to invoke avrgcc and avrdude ( to compile and upload the code) is all what we have. It is tested on both GNU/Linux and MS-Windows. Debian packages are available.
fr: MicroHOPE est un système de développement basé sur le micro-contrôleur Atmel ATmega32. Développé par l'IUAC, New Delhi, et publié comme matériel libre. À la différence d'autres systèmes, le point central est la compréhension des fondamentaux de l'architecture du micro-contrôleur et la programmation plutôt que l'étude des fonctionnalités du kit de développement. Le savoir acquis sur l'Atmega32 en utilisant microHOPE peut être facilement appliqué dans la compréhension d'autres micro-contrôleurs. Il n'i a pas d'environnement graphique complexe pour microHOPE. Un simple éditeur texte avec quelques boutons supplémentaires pour invoquer avrgcc et avrdude (pour compiler et télécharger le code) est tout ce que l'on a. Il est testé sous GNU/Linux et MS-Windows. Des paquets Debian sont disponibles.

source: <code>#include &lt;avr/io.h&gt;</code> <code> .section.data ; data section starts here</code> <code>var1: .byte 0xEE ; initializedglobal variable var1</code> <code> .section .text ; code section</code> <code> .global __do_copy_data ; initialize global variables</code> <code> .global __do_clear_bss ; and setup stack pointer</code> <code> .global main</code> <code>main:</code> <code> LDS R1, var1 ; load R1 using data direct mode</code> <code> STS DDRA, R1 ; display R1 on port A</code> <code> STS PORTA, R1</code> <code> LDI R26, lo8(var1) ; load the lower and</code> <code> LDI R27, hi8(var1) ; higher bytes of the address of var1 to X</code> <code> LD R16, X ; Load R16 using data-indirect mode, data from where X is pointing to</code> <code> STS DDRB, R16 ; display R16 on port B</code> <code> STS PORTB, R16</code> <code> .end</code>
fr: <code>#include &lt;avr/io.h&gt;</code> <code> .section.data ; la section de données commence ici</code> <code>var1: .byte 0xEE ; initialisation de la variable globale var1</code> <code> .section .text ; section de code</code> <code> .global __do_copy_data ; initialisation des variables globales</code> <code> .global __do_clear_bss ; et préparation du pointeur de pile</code> <code> .global main</code> <code>main:</code> <code> LDS R1, var1 ; charger R1 avec le mode direct d'accès aux données</code> <code> STS DDRA, R1 ; envoyer R1 sur le port A</code> <code> STS PORTA, R1</code> <code> LDI R26, lo8(var1) ; charger les octets les moins et</code> <code> LDI R27, hi8(var1) ; les plus significatifs de l'adresse de var1 vers X</code> <code> LD R16, X ; Charger R16 en utilisant le mode indirect d'accès aux données, l'adresse contenant l'index vers X</code> <code> STS DDRB, R16 ; envoyer R16 sur le port B</code> <code> STS PORTB, R16</code> <code> .end</code>

source: Piezo Buzzer, Frequency response
fr: Buzzer piézo, réponse en fréquence

source: 9-Feb-12 : Sent PIC24 uC based PCB for fabrication.
fr: 2012-02-09 : Envoyé le ciruit imprimé basé sur un microcontrôleur PIC à la fabrication.

source: Programs having Data
fr: Programmes avec des données

source: <a href="http://www.raspberrypi.org/archives/tag/expeyes">expEYES meets Raspberry Pi</a> , May 16, 2012
fr: <a href="http://www.raspberrypi.org/archives/tag/expeyes">expEYES rencontre Raspberry Pi</a>, 16 mai 2012

source: Measuring resistance, by comparison
fr: Mesure de résistance, par comparaison

source: Arithmetic and logical operations will affect the status flag bits like Carry, Zero, Negative etc. Refer to Atmega32 databook for complete information.
fr: Les opérations arithmétiques et logiques affectent les bits drapeaux de statut comme la retenue (Carry), la détection de zéro (Zero), la détection de valeur négative (Negative) etc. Se référer au manuel de l'Atmega32 pour une information complète.

source: <a href="Documents/Examples/mass-spring-euler.py">mass-spring-euler.py</a> : Solve the mass on a spring system using Euler method of integration. <a href="Documents/Images/mass-spring-euler.png">screenshot</a>
fr: <a href="Documents/Examples/mass-spring-euler.py">mass-spring-euler.py</a> : résolution de la masse d'un système à ressort en utilisant la méthode d'intégration d'Euler. <a href="Documents/Images/mass-spring-euler.png">Copie d'écran</a>.

source: 29-Dec-11 : PCB sent for fabrication.
fr: 2011-12-29 : Circuit imprimé envoyé à la fabrication.

source: Current = V/R = 1.254/1000 = 1.254 mA . The same amount of current flows through the unknown resistor.
fr: Courant = U/R = 1,254/1000 = 1,254 mA. Un courant de même valeur traverse la résistance inconnue.

source: Sound Velocity
fr: Vitesse du son

source: Transient response of RL circuit
fr: Réponse transitoire d'un circuit RL

source: Currently expEYES is available from several vendors. However, it would be convenient if it is available from a local store, especially for institution that cannot order online by making advance payment. One option is to ask some computer vendor in your locality to become a dealer of expEYES. They will be able to sell at the same price by getting commission from the manufacturers.
fr: Actuellement expEYES est disponible chez plusieurs vendeurs. Cependant, il serait convenable qu'il soit disponible chez un magasin local, particulièrement pour les institutions qui ne peuvent pas commander en ligne, en payant d'avance. Une oprion est de demander à un vendeur d'ordinateurs dans votre ville de devenir revendeur d'expEYES. Il pourra vendre au même prix en recevant une commission des fabricants.

source: <strong>OUT</strong> (output to any Special Function Register) : The SFRs are mapped to the locations 0 to 3Fhex. 0x17 and 0x18 are the I/O mapped addresses of the registers DDRB and PORTB respectively.
fr: <b>OUT</b> (sortie vers n'importe quel registre de fonction spéciale) : les SFRs sont affectés aux adresses 0 à 3Fhex. 0x17 et 0x18 sont les adresses affectées aux entrées/sorties des registres DDRB et PORTB respectivement.

source: Various AC waveforms
fr: Divers signaux alternatifs

source: Any numerical value that needs to be used in the program needs to be first loaded into one of the GPRs. So, if you want to load 0xff into DDRB, you first need to load 0xff into a GPR and then copy the content of the GPR into DDRB. This might seem like an unnecessary restriction to us who have been used to writing DDRB=0xff in C, but it is a necessary consequence of the streamlined hardware design of the processor which C hides from us.
fr: Toute valeur numérique qui doit être utilisée dans le programme doit d'abord être chargée dans un des GPRs. Ainsi, si on veut charger 0xff dans DDRB, il faut d'abord charger 0xff dans un GPR et ensuite copier le contenu du registre vers DDRB. Cela peut sembler une restriction inutile, à nous qui avons pour habitude d'écrire DDRB=0xff en langage C, mais c'est une conséquence de la conception du matériel que le langage C cache à nos yeux.

source: 555 oscillator
fr: Oscillateur 555

source: Thermistor: Resistance changes considerably with temperature. Positive and negative temperature coefficient versions available.
fr: Thermistances : leur résistance change considérablement avec la température. Il en existe avec des coefficients de température positifs ou négatifs.

source: Talking to the PC, via USB
fr: Communiquer avec le PC, par le câble USB

source: The figure shows how to connect the ISP to MicroHOPE. <strong>MicroHOPE is powered by the USBASP board, using an external wire. </strong>
fr: La figure montre comment connecter l'ISP à microHOPE. <strong>MicroHOPE est alimenté par la carte USBASP, à l'aide d'un fil externe.</strong>

source: ExpEYES software is written in Python and it should run on any computer having Python interpreter (version &gt; 2.7) and Python Serial library. It is included in the Debian and Ubuntu (version &gt; 13.04) GNU/Linux distributions. Otherwise it can be installed from <a href="http://expeyes.in/Documents/expeyes-3.1.0.deb">expeyes.deb</a> file.<br/> <br/> 1. The expEYES Live ISO images for DVDs and USB pendrives<br/> <br/> The fastest way to get expEYES running on your PC is to boot your computer from a DVD or USB pendrive, prepared using the <a href="http://www.it.iitb.ac.in/AakashApps/repo/GNU-Linux-on-Aakash/expEYES-14.04_i386_v15.iso">ISO image</a>. The procedure to to this on MSWindows is explained <a href="http://www.ubuntu.com/download/desktop/create-a-usb-stick-on-windows">here</a>. Once you boot from the pen-drive, the Lubuntu desktop will appear. Start the expEYES program from the Applications-&gt;Science menu. Download the ISO images of the Live DVD. This ISO image is prepared from Lubuntu 14.04 and contains other educational resources also.<br/> <br/> 3. On Other GNU/Linux Distributions<br/> <br/> Download <a href="Code/eyes-junior.zip">expeyes.zip</a> and do the following:
fr: Le logiciel expEYES est écrit en Python et devrait fonctionner sur tout ordinateur disposant de Python (version &gt; 2.7) et les bibliothèques Python "serial". Il est inclus dans les distributions Debian et Ubuntu (version &gt; 13.04). Autrement on peut l'installer depuis le fichier <a href=\http://expeyes.in/Documents/expeyes-3.1.0.deb">expeyes.deb</a><br><br/> 1. les images vives ISO expEYES pour DVD et clé USB<br/><br/> La façon la plus rapide d'avoir expEYES en marche sur votre PC consiste à démarrer son PC depuis un DVD ou une clé USB., préparée à l'aide d'<a href="http://www.it.iitb.ac.in/AakashApps/repo/GNU-Linux-on-Aakash/expEYES-14.04_i386_v15.iso">une image ISO</a>. La procédure pour le faire sous MS Windows est expliquée <a href="http://www.ubuntu.com/download/desktop/create-a-usb-stick-on-windows">ici</a>. Une fois qu'on a démarré depuis la clé USB, le bureau Lubuntu va apparaître. Démarrer le programme expEYES depuis le menu Applications-&gt;Science. Téléchargez les images ISO du DVD vif. Cette image ISO est préparée à partir de Lubuntu 14.04 et contient d'autres ressources éducatives aussi.<br/><br/> 2. Sur d'autres distributions GNU/Linux<br/><br/> Télécharger <a href="Code/eyes-junior.zip">expeyes.zip</a> et faire comme suit :

source: MicroHOPE does not have compiled libraries, we have provided include files to perform various tasks like writing to the LCD display, setting the timers etc. All the include files start with mh- . These files are meant for beginners to get started with using the features of the micro-controller. The users are encouraged to look at the C files and understand how the functions work. They are expected to grow beyond that and configure the peripherals by manipulating the special function registers directly. Directly configuring the peripherals would require referring to the ATMega32 <a href="http://www.atmel.com/images/doc2503.pdf">data book</a>, but would greatly increase the flexibility with which they can be used.
fr: MicroHOPE n'a pas de bibliothèques compilées, on a fourni des fichiers à inclure pour réaliser diverses tâches comme écrire sur l'afficheur LCD, régler les timers etc. Tous les fichiers à inclure commencent par mh- . Ces fichiers sont destinés à des débutants pour commencer à utiliser les fonctionnalités du micro-contrôleur. On encourage les utilisateurs à examiner les fichiers C et comprendre comment ceux-ci fonctionnent. Il sont supposés faire mieux et configurer les périphériques en manipulant les registres de fonctions spéciales directement. La configuration directe des périphériques demande de se référer au <a href="http://www.atmel.com/images/doc2503.pdf">manuel</a> de l'ATMega32, mais augmente considérablement la flexibilité des usages.

source: Study of Logic Gates
fr: Étude de portes logiques

source: Exercise 2: Add a number and it's 2's complement, do the same with 1's complement and compare the results
fr: <b>Exercice 2 :</b> additionner un nombre et son complément à 2, en faire autant avec son complément à 1 et comparer les résultats

source: <a href="Documents/Examples/integrate-trapez.py">integrate-trapez.py</a> : Calculate the area under an arc of unit radius from x=0 to 1, using trapezoid rule . Compare the result with pi/4. <a href="Documents/Images/integrate-trapez.png">screenshot</a>
fr: <a href="Documents/Examples/integrate-trapez.py">integrate-trapez.py</a> : calcul de l'aire sous un arc de rayon un, de x=0 à 1, à l'aide de la règle des trapèzes. Compare le résultat avec pi/4. <a href="Documents/Images/integrate-trapez.png">Copie d'écran</a>.

source: Digitizing sound waves
fr: Numérisation d'ondes sonores

source: <a href="http://community.ofset.org/index.php/Georges_Khaznadar">Georges Khaznadar</a>, Teacher of Physics at <a class="external text" href="http://www.lyceejeanbart.fr/" title="http://www.lyceejeanbart.fr">lycée Jean Bart, Dunkerque, France</a> (georges.khaznadar _at_ free.fr)
fr: <a href="http://community.ofset.org/index.php/Georges_Khaznadar">Georges Khaznadar</a>, professeur de physique au <a class="external text" href="http://www.lyceejeanbart.fr/" title="http://www.lyceejeanbart.fr">lycée Jean Bart, Dunkerque, France</a> (georges.khaznadar _at_ free.fr)

source: <code>#include &lt;avr/io.h&gt;</code> <code> .section .text ; denotes code section</code> <code> .global main</code> <code>main:</code> <code> LDI R16, 255 ; load R16 with 255</code> <code> STS DDRB, R16 ; set all bits of port B as output</code> <code> LDI R16, 2 ; load R16 with 2</code> <code> LDI R17, 4 ; load R17 with 4</code> <code> ADD R16, r17 ; R16 &lt;- R16 + R17</code> <code> STS PORTB, R16 ; result to port B</code> <code> .END</code>
fr: <code>#include &lt;avr/io.h&gt;</code> <code> .section .text ; dénote la section de code</code> <code> .global main</code> <code>main:</code> <code> LDI R16, 255 ; charger R16 avec 255</code> <code> STS DDRB, R16 ; régler tous les bits du port B en sortie</code> <code> LDI R16, 2 ; charger R16 avec 2</code> <code> LDI R17, 4 ; charger R17 avec 4</code> <code> ADD R16, r17 ; R16 &lt;- R16 + R17</code> <code> STS PORTB, R16 ; résultat dans le port B</code> <code> .END</code>

source: <a href="http://ijedict.dec.uwi.edu/viewarticle.php?id=1202">Example of PHOENIX usage at UPSI</a>, Malaysia, 2011
fr: <a href="http://ijedict.dec.uwi.edu/viewarticle.php?id=1202">Exemple d'utilisation de PHOENIX à l'UPSI</a>, Malaisie, 2011

source: AM and FM
fr: Modulation d'amplitude et de fréquence

source: <code>#include &lt;avr/io.h&gt;</code> <code> .section .text ; denotes code section</code> <code> .global main</code> <code>main:</code> <code> LDI R16, 255</code> <code> STS DDRB, R16 ; All bits of port B as output</code> <code> STS DDRA, R16 ; All bits of port A as output</code> <code> LDI R17, 1 ; load R17 with 1, R16 already has 255</code> <code> ADD R16, R17 ; R16 &lt;- R16 + r17</code> <code> STS PORTB,R16 ; Sum to port B</code> <code> LDS R16, SREG ; Load the Status register</code> <code> STS PORTA,R16 ; display it on port A</code> <code> .END</code>
fr: <code>#include &lt;avr/io.h&gt;</code> <code> .section .text ; dénote la section de code</code> <code> .global main</code> <code>main:</code> <code> LDI R16, 255</code> <code> STS DDRB, R16 ; Tous les bits du port B comme sorties</code> <code> STS DDRA, R16 ; Tous les bits du port A comme sorties</code> <code> LDI R17, 1 ; charger R17 avec 1, R16 contient déjà 255</code> <code> ADD R16, R17 ; R16 &lt;- R16 + R17</code> <code> STS PORTB,R16 ; additionner au port B</code> <code> LDS R16, SREG ; Charge le registre de Statut</code> <code> STS PORTA,R16 ; L'afficher sur le port A</code> <code> .END</code>

source: Piezo Buzzer
fr: Buzzer piézo

source: ExpEYES Junior User's Manual. Download from <a href="http://www.iuac.res.in/%7Eelab/expeyes/Documents/eyesj-a4.pdf"> here </a> ( or <a href="Documents/eyesj-a4.pdf">here</a>)
fr: Le manuel utilisateur d'expEYES. À télécharger depuis <a href="http://www.iuac.res.in/%7Eelab/expEYES/Documents/eyesj-a4.pdf"> ici</a> (ou <a href="Documents/eyesj-a4.pdf">ici</a>)

source: Velocity of moving body, photogates
fr: Vitesse de mobiles, à l'aide de barrières photo-électriques

source: Evolution of expEYES Junior
fr: Évolutions d'expEYES Junior

source: <a href="Documents/Examples/second-order-de-scipy.py">second-order-de-scipy.py</a> : Solving second order equation by splitting into two first order ones. solve d2y/dx2 = -y gives y=sin(x). <a href="Documents/Images/second-order-de-scipy.png">screenshot</a>
fr: <a href="Documents/Examples/second-order-de-scipy.py">second-order-de-scipy.py</a> : solution d'équation d'ordre 2 en la divisant en deux équations d'ordre 1. Solution de d2y/dx2 = -y donne y=sin(x). <a href="Documents/Images/second-order-de-scipy.png">Copie d'écran</a>.

source: AC generator
fr: Générateur de courant alternatif
